[
  {
    "id": "550e8400-e29b-41d4-a716-446655440001",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "Exercise increases BDNF production, which helps grow new brain cells and protects existing ones.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "BDNF (Brain-Derived Neurotrophic Factor) is like fertilizer for your brain. Exercise does increase BDNF production, which helps grow new brain cells and protects existing ones, particularly in areas related to memory and mood regulation.",
    "hints": [
      "Think of BDNF as brain fertilizer",
      "The article mentions this chemical helps with memory and mood"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440002",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "Just 20 minutes of moderate exercise can reduce anxiety symptoms for up to 12 hours.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "Research shows that just 20 minutes of moderate exercise can reduce anxiety symptoms for up to 12 hours. This makes it a better return on investment than many other stress-relief activities.",
    "hints": [
      "This is one of the key takeaways from the article",
      "Think about the duration of anxiety relief mentioned"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440003",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "Exercise naturally boosts serotonin and dopamine without the side effects of medications.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "Exercise naturally boosts serotonin and dopamine neurotransmitters, which are often targeted by antidepressant medications. The difference is that exercise does this without side effects and with additional physical benefits.",
    "hints": [
      "Consider what the article says about exercise vs. medications",
      "Think about neurotransmitters that affect mood"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440004",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "Regular exercise can completely replace professional mental health care for all conditions.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "While exercise is powerful for mental health, the article clearly states it's not a replacement for professional mental health care when needed, but rather a powerful complement that everyone can access.",
    "hints": [
      "The article mentions exercise as a 'complement' to something",
      "Consider the article's balanced approach to mental health treatment"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440005",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "When you exercise and feel short of breath with an increased heart rate, your brain learns these sensations aren't dangerous, which helps with:",
    "question_type": "standalone",
    "options": [
      "Building cardiovascular endurance",
      "Retraining your nervous system to be less reactive to anxiety",
      "Improving your lung capacity",
      "Teaching your brain to count sheep while running"
    ],
    "correct_answer_index": 1,
    "explanation": "The article explains that when you exercise, your heart rate increases and you might feel short of breath - similar to anxiety symptoms. But in the context of exercise, your brain learns these sensations aren't dangerous, which helps retrain your nervous system to be less reactive to stress.",
    "hints": [
      "Think about how exercise symptoms relate to anxiety symptoms",
      "Consider what your brain learns during exercise"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440006",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "According to the article, regular exercise can be as effective as medication for:",
    "question_type": "standalone",
    "options": [
      "Severe clinical depression",
      "Mild to moderate depression",
      "Bipolar disorder",
      "Making you forget you ever had problems (magical amnesia mode)"
    ],
    "correct_answer_index": 1,
    "explanation": "Studies show that regular exercise can be as effective as medication for mild to moderate depression, providing structure, social connection, self-efficacy, and improved sleep quality.",
    "hints": [
      "The article mentions a specific severity level of depression",
      "Consider the four reasons given for why exercise helps depression"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440007",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "Exercise helps complete the stress response cycle because modern stress triggers are typically:",
    "question_type": "standalone",
    "options": [
      "Physical threats requiring physical action",
      "Mental/emotional stressors that don't require physical action",
      "Always life-threatening emergencies",
      "Caused by an overabundance of gym memberships"
    ],
    "correct_answer_index": 1,
    "explanation": "The article explains that modern life triggers our stress response constantly through emails, traffic, and deadlines, but this system evolved for physical threats that required physical action. Exercise helps complete this stress cycle by providing the physical action component.",
    "hints": [
      "Think about what modern stressors are versus what our stress response evolved for",
      "Consider emails, traffic, and deadlines versus physical threats"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440008",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "Walking has been shown to increase creative output by up to what percentage?",
    "question_type": "standalone",
    "options": [
      "30%",
      "45%",
      "60%",
      "200% (you basically become Picasso on legs)"
    ],
    "correct_answer_index": 2,
    "explanation": "According to the article, walking has been shown to increase creative output by up to 60%, making it a powerful tool for cognitive enhancement beyond just physical health.",
    "hints": [
      "The article mentions a specific percentage for creativity boost",
      "This is one of the cognitive benefits listed"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440009",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "When designing an exercise program for mental health, which sequence represents the best approach for someone struggling with low motivation?",
    "question_type": "standalone",
    "options": [
      "Start with intense workouts, track calories burned, focus on weight loss",
      "Start ridiculously small, lower the bar for 'bad' days, time it right, track mood",
      "Only exercise when feeling motivated, maintain perfect form always, compete with others",
      "Start by buying expensive equipment, join advanced classes, post everything on social media"
    ],
    "correct_answer_index": 1,
    "explanation": "The article emphasizes starting ridiculously small when motivation is low, lowering the bar for difficult days, timing workouts right (like mornings), and tracking mood rather than just fitness metrics to build sustainable habits.",
    "hints": [
      "Think about what the article says about working with low motivation",
      "Consider the practical tips given for when you need exercise most"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440010",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "According to the article, regular exercisers show what percentage reduction in both depression and anxiety risk?",
    "question_type": "standalone",
    "options": [
      "10-15% reduction",
      "20-30% reduction",
      "40-50% reduction",
      "100% reduction (exercise makes you invincible to all negative emotions)"
    ],
    "correct_answer_index": 1,
    "explanation": "The article states that active people have 20-30% lower risk of depression and anxiety, plus 28% reduction in Alzheimer's risk, showing exercise's powerful preventive effects on mental health.",
    "hints": [
      "Look for the specific percentages mentioned for mental health protection",
      "This is in the section about long-term protection"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440011",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "Which combination represents the article's recommended approach to using exercise as mental health medicine?",
    "question_type": "standalone",
    "options": [
      "High intensity only, weekend warrior style, compete with others, ignore consistency",
      "Consistency over intensity, schedule like medication, find minimum effective dose, use acutely for stress",
      "Only when feeling good, avoid during stress, focus solely on weight loss, exercise indoors only",
      "Extreme daily workouts, ignore rest days, exercise only for appearance, never modify intensity"
    ],
    "correct_answer_index": 1,
    "explanation": "The article's bottom line emphasizes consistency over intensity, scheduling exercise like medication, finding your minimum effective dose, and using exercise acutely when feeling anxious or stressed, plus stacking benefits with outdoor exercise.",
    "hints": [
      "Look at the 'Practical Integration' section of the article",
      "Think about the five key recommendations given"
    ],
    "image_urls": []
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440012",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "What was Sarah's main concern about starting exercise for her anxiety?",
    "question_type": "passage_based",
    "options": [
      "She didn't have proper workout clothes",
      "The thought of going to a gym made her panic worse",
      "She was worried about the cost of a membership",
      "She was afraid people would judge her dance moves"
    ],
    "correct_answer_index": 1,
    "explanation": "In Sarah's passage, she's described as having morning anxiety and her therapist had suggested exercise, but 'the thought of going to a gym made her panic worse,' showing how anxiety can create barriers to the very activities that help it.",
    "hints": [
      "Focus on Sarah's initial reaction to the suggestion of exercise",
      "Think about what made her situation worse at first"
    ],
    "image_urls": [],
    "passage_set_id": "2bb3ab01-598c-4283-85f0-a1d8da12066f"
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440013",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "How did Sarah's perception of her racing heart change during her walk?",
    "question_type": "passage_based",
    "options": [
      "She realized she needed medical attention",
      "It went from feeling like panic to feeling like power",
      "She decided to run faster to make it race more",
      "She discovered she had superpowers and could fly"
    ],
    "correct_answer_index": 1,
    "explanation": "The passage shows Sarah's breakthrough moment: 'Her heart was racing - but for once, it was supposed to be. As she picked up the pace slightly, something shifted. The racing heart didn't feel like panic anymore; it felt like power.'",
    "hints": [
      "Look for the moment when Sarah's perspective shifted",
      "Think about how the same physical sensation felt different in context"
    ],
    "image_urls": [],
    "passage_set_id": "2bb3ab01-598c-4283-85f0-a1d8da12066f"
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440014",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "What did Sarah discover about the lasting effects of her walk?",
    "question_type": "passage_based",
    "options": [
      "Her anxiety completely disappeared forever",
      "Her usual evening anxiety spike wasn't as intense",
      "She immediately became a marathon runner",
      "She developed an addiction to sidewalk counting"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah noticed that 'when her usual anxiety spike hit around dinner time, it wasn't as intense,' and remembered her therapist mentioning that exercise effects last hours, showing the extended benefits of even a simple walk.",
    "hints": [
      "Think about what happened later in the day after her walk",
      "Consider what her therapist had mentioned about duration of effects"
    ],
    "image_urls": [],
    "passage_set_id": "2bb3ab01-598c-4283-85f0-a1d8da12066f"
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440015",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "What breakthrough did Sarah have about her anxiety sensations?",
    "question_type": "passage_based",
    "options": [
      "She learned to completely avoid all racing heart sensations",
      "She realized the same sensations felt different in different contexts",
      "She discovered anxiety was all in her imagination",
      "She found out that counting to ten cures everything"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah's key insight was captured in her mood tracking note: 'Same sensations, different context.' She learned that the physical feelings of a racing heart during exercise weren't threatening, which helped her brain recontextualize these sensations.",
    "hints": [
      "Look at what Sarah wrote in her mood tracking app",
      "Think about the main lesson she learned about physical sensations"
    ],
    "image_urls": [],
    "passage_set_id": "2bb3ab01-598c-4283-85f0-a1d8da12066f"
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440016",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "What was Mike's original approach to dealing with work stress through exercise?",
    "question_type": "passage_based",
    "options": [
      "Gentle yoga and meditation",
      "Pushing himself to exhaustion with heavy weights",
      "Taking long walks in nature",
      "Doing interpretive dance to express his feelings"
    ],
    "correct_answer_index": 1,
    "explanation": "The passage shows Mike 'slammed the weights down, his frustration evident' and was 'pushing himself to exhaustion,' believing that harder workouts meant better stress relief.",
    "hints": [
      "Look at Mike's behavior at the beginning of the passage",
      "Think about his initial belief about intensity and stress relief"
    ],
    "image_urls": [],
    "passage_set_id": "22423ce8-0de5-496c-b234-0c902f8f3458"
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440017",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "According to Taylor, what happens when they do intense workouts?",
    "question_type": "passage_based",
    "options": [
      "Their anxiety decreases significantly",
      "Their stress hormones spike and blood sugar gets unstable",
      "They sleep better than ever",
      "They develop the ability to lift cars above their head"
    ],
    "correct_answer_index": 1,
    "explanation": "Taylor explains that 'When I go too hard, my stress hormones spike and my blood sugar gets wonky,' showing how intense exercise can actually worsen their health conditions rather than help them.",
    "hints": [
      "Focus on what Taylor says about their personal response to intense exercise",
      "Consider their health conditions (pre-diabetes and anxiety)"
    ],
    "image_urls": [],
    "passage_set_id": "22423ce8-0de5-496c-b234-0c902f8f3458"
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440018",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "What key insight does Taylor share about moderate exercise?",
    "question_type": "passage_based",
    "options": [
      "It's boring and ineffective",
      "Twenty minutes gives 12 hours of reduced anxiety",
      "It only works for people over 40",
      "It's best combined with loud music and neon lights"
    ],
    "correct_answer_index": 1,
    "explanation": "Taylor shares the research-backed insight that 'Twenty minutes of moderate work gives me 12 hours of reduced anxiety,' highlighting the sustained benefits of moderate-intensity exercise for mental health.",
    "hints": [
      "Look for the specific timeframes Taylor mentions",
      "Think about the duration of benefits from moderate exercise"
    ],
    "image_urls": [],
    "passage_set_id": "22423ce8-0de5-496c-b234-0c902f8f3458"
  },
  {
    "id": "550e8400-e29b-41d4-a716-446655440019",
    "created_at": "2024-01-13T00:00:00Z",
    "updated_at": "2024-01-13T00:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d480",
    "question_text": "What lesson does Mike learn from Taylor about exercise goals?",
    "question_type": "passage_based",
    "options": [
      "Always lift the heaviest weights possible",
      "Match your exercise to your specific goals - consistency beats intensity for mental health",
      "Only exercise when you feel stressed",
      "Mental health goals require special rainbow-colored equipment"
    ],
    "correct_answer_index": 1,
    "explanation": "Taylor's advice to Mike is to 'match your exercise to your goals' and that 'If mental health is one of them, consistency beats intensity every time,' teaching Mike to align his workout approach with his actual objectives.",
    "hints": [
      "Focus on Taylor's final advice to Mike",
      "Think about the relationship between exercise type and specific goals"
    ],
    "image_urls": [],
    "passage_set_id": "22423ce8-0de5-496c-b234-0c902f8f3458"
  },
  {
    "id": "35d34c86-0e91-416a-bd74-88b70c1b383c",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "True or False: After just one hour of sitting, your body's calorie-burning drops by 90%.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "This is true. The article explains that sitting for just one hour causes a dramatic 90% decrease in calorie-burning capacity, along with a 75% reduction in fat-breakdown enzymes. This demonstrates how quickly our metabolism responds to prolonged sitting.",
    "hints": [
      "Think about how dramatically sitting affects your metabolic rate",
      "Consider what happens to your body's fat-burning enzymes during prolonged sitting"
    ],
    "image_urls": []
  },
  {
    "id": "4282ea37-3c46-42dc-8b4a-f90c57bfa9bc",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "True or False: The 20-8-2 rule for standing desks means sit for 20 minutes, stand for 8 minutes, and move for 2 minutes every 30-minute period.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "This is correct. The 20-8-2 rule provides a practical framework for using standing desks effectively by breaking each 30-minute period into sitting, standing, and movement phases to avoid both prolonged sitting and static standing.",
    "hints": [
      "Remember the specific time breakdown for optimal standing desk use",
      "Consider how this rule balances sitting, standing, and movement"
    ],
    "image_urls": []
  },
  {
    "id": "501aa280-250d-47ae-b0c8-226f214cc242",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "True or False: Static standing at a standing desk can be almost as harmful as sitting.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "True. The article emphasizes that simply standing without movement isn't enough - static standing can be almost as problematic as sitting. The key is to incorporate movement like weight shifting, marching in place, or using a balance board.",
    "hints": [
      "Think about whether just standing motionless is sufficient",
      "Consider what the article says about the need for movement even while standing"
    ],
    "image_urls": []
  },
  {
    "id": "8a22012f-3e78-49e0-befd-bb7266eeb9cb",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "True or False: Using a small water bottle is a strategic way to increase movement throughout the workday.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "True. The article specifically mentions the 'water bottle strategy' - using a small water bottle forces you to refill it more often, creating natural movement breaks throughout the day, plus additional bathroom breaks for even more movement.",
    "hints": [
      "Consider how bottle size affects refill frequency",
      "Think about the secondary effects of drinking more water"
    ],
    "image_urls": []
  },
  {
    "id": "52e13f01-e54c-473b-bab2-da13faad09d6",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What happens to fat-breakdown enzymes after sitting for one hour?",
    "question_type": "standalone",
    "options": [
      "They decrease by 75%",
      "They increase by 25%",
      "They stay the same but work slower",
      "They transform into couch-potato enzymes"
    ],
    "correct_answer_index": 0,
    "explanation": "Fat-breakdown enzymes decrease by 75% after just one hour of sitting. This dramatic reduction, combined with the 90% drop in calorie-burning, shows how quickly sitting affects our metabolism at the cellular level.",
    "hints": [
      "Think about the percentage decrease mentioned in the metabolic slowdown section",
      "Consider how sitting affects the enzymes responsible for breaking down fat"
    ],
    "image_urls": []
  },
  {
    "id": "6835fa8d-9a3a-447c-bc6a-56cf3dfd1951",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "According to the article, how often should you set a timer to remind yourself to move?",
    "question_type": "standalone",
    "options": [
      "Every 30 minutes",
      "Every hour",
      "Every 15 minutes",
      "Every time your boss isn't looking"
    ],
    "correct_answer_index": 0,
    "explanation": "The article recommends the '30-minute rule' - setting a timer every 30 minutes to do something that gets you moving for just 60 seconds. This frequent reminder helps break up prolonged sitting periods effectively.",
    "hints": [
      "Look for the specific rule mentioned about timer intervals",
      "Consider what frequency provides the best balance between interruption and benefit"
    ],
    "image_urls": []
  },
  {
    "id": "bbfda2b4-c182-4dd5-adf3-a00e253ecb95",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What is the recommended lunch break split according to the 20-20-20 strategy?",
    "question_type": "standalone",
    "options": [
      "20 minutes eating, 20 minutes walking, 20 minutes returning/prep",
      "20 minutes working, 20 minutes eating, 20 minutes napping",
      "20 minutes complaining about work, 20 minutes scrolling social media, 20 minutes panicking about afternoon meetings",
      "20 minutes for each meal course"
    ],
    "correct_answer_index": 0,
    "explanation": "The 20-20-20 lunch split divides your lunch hour into three equal parts: 20 minutes for eating, 20 minutes for walking or physical activity, and 20 minutes for returning to your workspace and preparing for the afternoon.",
    "hints": [
      "Think about how to optimally divide a 60-minute lunch break",
      "Consider what activities would best support movement and health during lunch"
    ],
    "image_urls": []
  },
  {
    "id": "ee54f12b-eb41-471c-b39d-c4ac57b70f70",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "Which stealth exercises can you do at your desk without anyone noticing?",
    "question_type": "standalone",
    "options": [
      "Ankle circles, glute squeezes, shoulder blade squeezes, neck rotations, core bracing",
      "Jumping jacks, burpees, mountain climbers, high knees",
      "Deadlifts, squats, bench press, overhead press",
      "Interpretive dance, yoga flows, martial arts katas"
    ],
    "correct_answer_index": 0,
    "explanation": "The article lists these specific 'stealth exercises' that can be done discreetly at your desk: ankle circles under your desk, glute squeezes while sitting, shoulder blade squeezes, neck rotations during phone calls, and core bracing while typing.",
    "hints": [
      "Think about exercises that can be done while sitting that others won't notice",
      "Consider movements that don't require standing up or obvious motion"
    ],
    "image_urls": []
  },
  {
    "id": "86b22edb-923e-4820-adb8-b5f978936c7b",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What is the proper progression for standing desk beginners?",
    "question_type": "standalone",
    "options": [
      "Start with 30 minutes daily, increase by 30 minutes weekly until you find your sweet spot",
      "Start with 8 hours immediately to maximize benefits",
      "Alternate every 5 minutes between sitting and standing",
      "Stand only during meetings to assert dominance"
    ],
    "correct_answer_index": 0,
    "explanation": "The article recommends a gradual approach: start with just 30 minutes of standing per day, then increase by 30 minutes each week until you find your optimal balance. This prevents fatigue and allows your body to adapt slowly.",
    "hints": [
      "Think about gradual progression rather than immediate change",
      "Consider what weekly increment would be sustainable for beginners"
    ],
    "image_urls": []
  },
  {
    "id": "63802551-7f38-4fa4-9e9e-bcbd0df3d62d",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "According to the energy management strategy, what should you do instead of having coffee during the afternoon slump?",
    "question_type": "standalone",
    "options": [
      "A 2-minute exercise burst",
      "Take a 30-minute nap",
      "Eat a large sugary snack",
      "Switch to decaf and pretend it's helping"
    ],
    "correct_answer_index": 0,
    "explanation": "The article suggests doing a 2-minute exercise burst instead of reaching for coffee during the afternoon energy slump. This natural energy boost can be more effective and healthier than caffeine.",
    "hints": [
      "Think about natural alternatives to caffeine for energy",
      "Consider what brief activity could provide an energy boost"
    ],
    "image_urls": []
  },
  {
    "id": "30184f43-b82b-4c49-9644-d5410ce28376",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What calculation demonstrates the compound effect of small movement breaks throughout the workday?",
    "question_type": "standalone",
    "options": [
      "5 minutes every hour = 40 minutes daily = 200 minutes weekly = 3+ hours of movement",
      "10 minutes every hour = 2 hours daily = 10 hours weekly",
      "1 minute every hour = 8 minutes daily = 40 minutes weekly",
      "Movement breaks = coffee breaks = happiness breaks = productivity breaks"
    ],
    "correct_answer_index": 0,
    "explanation": "The article shows this powerful calculation: 5 minutes of movement every hour equals 40 minutes daily, which totals 200 minutes weekly, adding up to over 3 hours of movement you weren't getting before. This demonstrates how small, frequent actions compound significantly.",
    "hints": [
      "Look for the mathematical breakdown of how small movement breaks add up",
      "Consider the weekly and daily totals mentioned in the compound effect section"
    ],
    "image_urls": []
  },
  {
    "id": "f69c455c-28a4-4041-8e53-59467ddf5e77",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "Based on Emma's story in the first passage, what was her main discovery about movement breaks?",
    "question_type": "passage_based",
    "options": [
      "That small, frequent movement breaks throughout the day eliminated her back pain and increased her energy",
      "That she needed to quit her desk job to be healthy",
      "That expensive gym equipment was necessary for office fitness",
      "That her fitness tracker was broken and needed replacement"
    ],
    "correct_answer_index": 0,
    "explanation": "Emma discovered that taking movement breaks every 30 minutes - doing simple exercises like desk push-ups, walking to the water fountain, and calf raises during calls - eliminated her back pain and noticeably increased her energy levels by 5 PM.",
    "hints": [
      "Focus on what Emma learned from her 30-minute timer experiment",
      "Consider the physical and energy changes she experienced"
    ],
    "image_urls": [],
    "passage_set_id": "806e921c-6824-4ead-b1a7-101be8affede"
  },
  {
    "id": "6eaec675-1723-44ce-a117-73cdaa76ef9a",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What was the result of Emma's office movement revolution?",
    "question_type": "passage_based",
    "options": [
      "Half their team was doing 3 PM plank challenges in the conference room within three weeks",
      "She got fired for exercising at work",
      "Her colleagues complained to HR about the disruption",
      "Nothing changed because people are resistant to new ideas"
    ],
    "correct_answer_index": 0,
    "explanation": "Emma's small personal rebellion against prolonged sitting inspired her colleagues. Within three weeks, half their team had joined in doing 3 PM plank challenges in the conference room, showing how individual healthy changes can positively influence workplace culture.",
    "hints": [
      "Think about how Emma's individual actions spread to her coworkers",
      "Consider the timeframe and specific activity that became popular"
    ],
    "image_urls": [],
    "passage_set_id": "806e921c-6824-4ead-b1a7-101be8affede"
  },
  {
    "id": "8c5759d2-57ca-45bb-ad5d-cfaeab57b21a",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "How did Emma's colleague respond to her increased energy levels?",
    "question_type": "passage_based",
    "options": [
      "They noticed her improved mood and asked to join her walking meetings",
      "They were jealous and tried to sabotage her efforts",
      "They ignored the change completely",
      "They reported her to management for being too energetic"
    ],
    "correct_answer_index": 0,
    "explanation": "Emma's colleague noticed she seemed more upbeat than usual and was interested in joining her approach. When Emma explained her movement breaks, the colleague was receptive and wanted to participate in walking meetings.",
    "hints": [
      "Consider the positive reaction Emma received from her coworker",
      "Think about how her energy change was perceived by others"
    ],
    "image_urls": [],
    "passage_set_id": "806e921c-6824-4ead-b1a7-101be8affede"
  },
  {
    "id": "93187286-1518-4921-90f9-219d3bc4a77d",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What specific improvement did Emma see in her daily activity by 5 PM?",
    "question_type": "passage_based",
    "options": [
      "Her fitness tracker showed 5,000 steps instead of 1,500, and her back pain had disappeared",
      "She had completed a full marathon at her desk",
      "She had gained 10 pounds of muscle",
      "She had developed superhuman strength from desk push-ups"
    ],
    "correct_answer_index": 0,
    "explanation": "By implementing movement breaks every 30 minutes throughout the day, Emma's fitness tracker showed a significant increase from 1,500 steps to 5,000 steps by 5 PM, and her back pain - which she had complained about in the morning - had completely disappeared.",
    "hints": [
      "Look for the specific step count numbers mentioned in Emma's story",
      "Consider what happened to her back pain by the end of the day"
    ],
    "image_urls": [],
    "passage_set_id": "806e921c-6824-4ead-b1a7-101be8affede"
  },
  {
    "id": "06efbb81-8ae3-4741-9cea-54c334b5bccf",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What was Jordan's initial approach to fitness that wasn't working?",
    "question_type": "passage_based",
    "options": [
      "Planning perfect gym workouts at 6 AM but missing them due to work deadlines",
      "Doing only weekend warrior workouts",
      "Following a strict diet without any exercise",
      "Trying to exercise while working 24/7"
    ],
    "correct_answer_index": 0,
    "explanation": "Jordan, the perfectionist, had planned a perfect routine of gym at 6 AM, shower, and work by 8, but project deadlines meant working all night, making the 5 AM alarm impossible. This all-or-nothing approach led to missing workouts entirely.",
    "hints": [
      "Think about Jordan's perfectionist tendency and planned schedule",
      "Consider what prevented Jordan from executing the perfect plan"
    ],
    "image_urls": [],
    "passage_set_id": "7babc5da-df78-435a-b126-1bcb566c3ea0"
  },
  {
    "id": "c80282a4-3755-42d4-b8b9-bc7f0aca0093",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What concept did Alex introduce to Jordan as an alternative to perfect workouts?",
    "question_type": "passage_based",
    "options": [
      "Exercise snacks - brief, frequent movement breaks throughout the day",
      "Workout sandwiches - exercising before and after meals",
      "Fitness appetizers - tiny workouts to build up to bigger ones",
      "Movement desserts - rewards after completing work tasks"
    ],
    "correct_answer_index": 0,
    "explanation": "Alex introduced Jordan to the concept of 'exercise snacks' - doing different movements every hour like burpees, squats, stretches, or quick walks instead of trying to fit in one perfect workout session.",
    "hints": [
      "Focus on the specific term Alex used to describe brief movement breaks",
      "Think about the food-related metaphor for small, frequent exercise"
    ],
    "image_urls": [],
    "passage_set_id": "7babc5da-df78-435a-b126-1bcb566c3ea0"
  },
  {
    "id": "733753c3-355b-4db5-aeb6-92fe5357830a",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "How did Alex's productivity change after implementing exercise snacks?",
    "question_type": "passage_based",
    "options": [
      "Productivity increased, and step count was higher than when doing only morning workouts",
      "Productivity decreased due to constant interruptions",
      "No change in productivity but better mood",
      "Productivity stayed the same but became more tired"
    ],
    "correct_answer_index": 0,
    "explanation": "Alex explained that productivity actually improved after each movement break, and surprisingly, the daily step count was higher with exercise snacks throughout the day than when doing only morning gym workouts.",
    "hints": [
      "Consider the unexpected benefits Alex experienced with frequent movement breaks",
      "Think about how Alex's step count compared between the two approaches"
    ],
    "image_urls": [],
    "passage_set_id": "7babc5da-df78-435a-b126-1bcb566c3ea0"
  },
  {
    "id": "87f7e74c-2680-41a8-90d2-e6d43f9b4e84",
    "created_at": "2024-01-14T00:00:00Z",
    "updated_at": "2024-01-14T00:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d481",
    "question_text": "What was Jordan's key realization by the end of the passage?",
    "question_type": "passage_based",
    "options": [
      "That the best fitness plan isn't the perfect one, but the one you can actually stick to",
      "That perfect planning is the most important aspect of fitness",
      "That morning workouts are impossible to maintain",
      "That coffee is better than exercise for energy"
    ],
    "correct_answer_index": 0,
    "explanation": "Jordan's perfectionist mindset was challenged when they realized that having a perfect plan that couldn't be executed was less valuable than having an imperfect but sustainable approach. The key insight was that consistency beats perfection in fitness.",
    "hints": [
      "Think about Jordan's shift from perfectionist thinking to practical thinking",
      "Consider the lesson about sustainable versus perfect approaches"
    ],
    "image_urls": [],
    "passage_set_id": "7babc5da-df78-435a-b126-1bcb566c3ea0"
  },
  {
    "id": "27146f6a-8e9b-48b6-bd53-f1d9b8a487e0",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "During deep sleep, your body releases up to 70% of its daily growth hormone.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "This is correct. During deep sleep stages, the body releases the majority of its daily growth hormone production, which is crucial for muscle repair, fat burning, and tissue regeneration.",
    "hints": [
      "Growth hormone is essential for muscle recovery",
      "Deep sleep is when most physical repair happens"
    ],
    "image_urls": []
  },
  {
    "id": "9a289f7c-2398-44e1-86de-6c593df14673",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "Sleep deprivation increases leptin (fullness hormone) and decreases ghrelin (hunger hormone).",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "This is false. Sleep deprivation actually decreases leptin by 18% (making you feel less full) and increases ghrelin by 28% (making you hungrier), which is why tired people crave more food.",
    "hints": [
      "Think about how you feel when you're tired and hungry",
      "Sleep loss makes appetite control harder"
    ],
    "image_urls": []
  },
  {
    "id": "b8a1017c-43e6-4fd0-8005-96b9b0ce42d4",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "People who sleep less than 6 hours lose significantly more muscle mass during weight loss compared to those who get 8 hours.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "This is true. Studies show that inadequate sleep during weight loss leads to greater muscle loss because the body cannot properly repair and maintain muscle tissue without sufficient sleep.",
    "hints": [
      "Sleep is when muscle repair happens",
      "Weight loss without adequate sleep affects body composition"
    ],
    "image_urls": []
  },
  {
    "id": "5bf7dd87-e051-4278-9911-905a390bf665",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "Athletes who sleep less than 8 hours are 1.7 times more likely to get injured.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "This is true. Research shows that sleep-deprived athletes have significantly higher injury rates due to slower reaction times, decreased accuracy, and impaired recovery.",
    "hints": [
      "Sleep affects reaction time and coordination",
      "Recovery happens during sleep"
    ],
    "image_urls": []
  },
  {
    "id": "621bdce2-3778-4869-b936-fa5b4ee23bf9",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "High-intensity exercise can delay sleep onset. How many hours before bed should you finish intense workouts?",
    "question_type": "standalone",
    "options": [
      "1 hour",
      "2-3 hours",
      "30 minutes",
      "Exactly at bedtime for maximum tiredness"
    ],
    "correct_answer_index": 1,
    "explanation": "High-intensity exercise raises core temperature and stress hormones, which can delay sleep by 2-3 hours. Light yoga or walking is fine closer to bedtime.",
    "hints": [
      "Exercise raises body temperature",
      "Your body needs time to cool down for sleep"
    ],
    "image_urls": []
  },
  {
    "id": "56df2f38-2f94-43f3-bb28-4a43c68fd4f0",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "What's the optimal room temperature range for quality sleep?",
    "question_type": "standalone",
    "options": [
      "65-68°F (18-20°C)",
      "70-75°F (21-24°C)",
      "60-63°F (15-17°C)",
      "Whatever temperature makes you sweat like a medieval blacksmith"
    ],
    "correct_answer_index": 0,
    "explanation": "The optimal sleep temperature is 65-68°F (18-20°C). Your body naturally drops in temperature as you fall asleep, and a cool room facilitates this process.",
    "hints": [
      "Your body temperature naturally drops when you sleep",
      "Cool environments help this natural process"
    ],
    "image_urls": []
  },
  {
    "id": "4cd93753-de76-4109-838e-22d902933347",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "Which supplement is mentioned as helping with both sleep and muscle recovery?",
    "question_type": "standalone",
    "options": [
      "Melatonin",
      "Magnesium glycinate",
      "L-theanine",
      "Crushed unicorn horn (ethically sourced)"
    ],
    "correct_answer_index": 1,
    "explanation": "Magnesium glycinate (200-400mg) is specifically mentioned as helping with sleep while also supporting muscle recovery, making it a dual-purpose supplement for active individuals.",
    "hints": [
      "Look for the supplement that has two benefits",
      "This mineral is important for muscle function"
    ],
    "image_urls": []
  },
  {
    "id": "cdcdefc2-9bb0-457d-89b7-cbde8c42e38b",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "How many extra calories per day do sleep-deprived people typically eat?",
    "question_type": "standalone",
    "options": [
      "150 calories",
      "385 calories",
      "500 calories",
      "All the calories in the kitchen because tired brain says 'survival mode activated'"
    ],
    "correct_answer_index": 1,
    "explanation": "Studies show sleep-deprived people eat an average of 385 extra calories per day, mostly from high-fat, high-carb foods as the body seeks quick energy.",
    "hints": [
      "It's a significant amount that could affect weight",
      "The body craves quick energy when tired"
    ],
    "image_urls": []
  },
  {
    "id": "273a8eda-4335-4569-acf5-97ba09a949fa",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "The 10-3-2-1-0 sleep rule provides a timeline for better sleep. What is the correct sequence?",
    "question_type": "standalone",
    "options": [
      "10 hrs: no caffeine, 3 hrs: no food/alcohol, 2 hrs: no work, 1 hr: no screens, 0: snooze hits",
      "10 hrs: no screens, 3 hrs: no caffeine, 2 hrs: no food, 1 hr: no work, 0: snooze hits",
      "10 hrs: no work, 3 hrs: no screens, 2 hrs: no caffeine, 1 hr: no food, 0: snooze hits",
      "10 hrs: no exercise, 3 hrs: no thinking, 2 hrs: no breathing, 1 hr: no existing, 0: transcendence"
    ],
    "correct_answer_index": 0,
    "explanation": "The 10-3-2-1-0 rule is: 10 hours before bed - no more caffeine, 3 hours - no more food or alcohol, 2 hours - no more work, 1 hour - no more screens, 0 - snooze button hits.",
    "hints": [
      "Caffeine has the longest timeline",
      "Screens are the last thing to avoid before bed"
    ],
    "image_urls": []
  },
  {
    "id": "d041448e-befc-43f5-a30b-5897ad0499cb",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "The 4-7-8 breathing technique for sleep involves which pattern and effect?",
    "question_type": "standalone",
    "options": [
      "Inhale 4, hold 7, exhale 8 - activates parasympathetic nervous system",
      "Inhale 8, hold 4, exhale 7 - activates sympathetic nervous system",
      "Inhale 4, hold 8, exhale 7 - activates digestive system",
      "Inhale 7, hold 4, exhale 8 - activates your neighbor's security system"
    ],
    "correct_answer_index": 0,
    "explanation": "The 4-7-8 breathing pattern (inhale for 4, hold for 7, exhale for 8) activates the parasympathetic nervous system, which promotes relaxation and sleep.",
    "hints": [
      "The parasympathetic system is your 'rest and digest' mode",
      "The exhale is the longest part"
    ],
    "image_urls": []
  },
  {
    "id": "fe40809c-403f-41c7-a399-f8cec0309873",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "Which combination of symptoms suggests you should see a doctor about your sleep?",
    "question_type": "standalone",
    "options": [
      "Loud snoring + gasping for air + feeling exhausted despite 'enough' sleep",
      "Occasional light snoring + feeling rested + falling asleep within 20 minutes",
      "Quiet breathing + waking up refreshed + consistent sleep schedule",
      "Snoring like a freight train + but sleeping like a baby + and dreaming of becoming a professional whistler"
    ],
    "correct_answer_index": 0,
    "explanation": "Loud snoring, gasping for air, and feeling exhausted despite adequate sleep duration are classic signs of sleep apnea, which requires medical evaluation and treatment.",
    "hints": [
      "Sleep apnea involves breathing disruptions",
      "Feeling tired despite sleeping enough is a red flag"
    ],
    "image_urls": []
  },
  {
    "id": "9a53bd8f-986f-4c60-b82c-2e7f30928811",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "Based on Taylor's situation, what was the main reason their workouts weren't improving their blood pressure?",
    "question_type": "passage_based",
    "options": [
      "They weren't exercising intensely enough",
      "Their elevated cortisol from poor sleep was canceling out exercise benefits",
      "They needed to eat more protein",
      "They were doing the wrong type of exercise"
    ],
    "correct_answer_index": 1,
    "explanation": "The doctor explained that Taylor's elevated cortisol levels from sleep deprivation were counteracting the positive effects of exercise, keeping their body in survival mode.",
    "hints": [
      "The doctor mentioned cortisol levels",
      "Sleep deprivation affects stress hormones"
    ],
    "image_urls": [],
    "passage_set_id": "94c6717d-3e2f-4066-a0b8-1570c63dbd65"
  },
  {
    "id": "59dbbbcc-824e-415e-9c26-36bfe5cad5a4",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "What analogy did Dr. Chen use to explain Taylor's situation?",
    "question_type": "passage_based",
    "options": [
      "Like running a marathon with ankle weights",
      "Like driving a car with the parking brake on",
      "Like swimming upstream against a current",
      "Like trying to fill a bucket with holes in it"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Chen used the analogy of driving with the parking brake on, explaining that cortisol was the 'brake' that needed to be released before exercise could be effective.",
    "hints": [
      "The analogy involved a vehicle",
      "It was about removing an obstacle to progress"
    ],
    "image_urls": [],
    "passage_set_id": "94c6717d-3e2f-4066-a0b8-1570c63dbd65"
  },
  {
    "id": "49adb717-76ab-4e03-b0cb-fe5b1a10b123",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "How many hours of sleep was Taylor averaging, and what did the doctor prescribe as the minimum?",
    "question_type": "passage_based",
    "options": [
      "3-4 hours average, 6 hours minimum prescribed",
      "4-5 hours average, 7 hours minimum prescribed",
      "5-6 hours average, 8 hours minimum prescribed",
      "6-7 hours average, 9 hours minimum prescribed"
    ],
    "correct_answer_index": 1,
    "explanation": "Taylor was getting 4-5 hours of sleep on average, and Dr. Chen prescribed a minimum of 7 hours as non-negotiable for their health recovery.",
    "hints": [
      "Taylor was getting very little sleep",
      "The doctor's prescription was firm"
    ],
    "image_urls": [],
    "passage_set_id": "94c6717d-3e2f-4066-a0b8-1570c63dbd65"
  },
  {
    "id": "0bf857e0-6f26-4687-b8ab-8ed9d05c1a8e",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "What exercise modifications did Dr. Chen recommend for Taylor's overloaded system?",
    "question_type": "passage_based",
    "options": [
      "Replace all exercise with complete rest",
      "Replace two intense sessions with yoga or walking, plus add meditation",
      "Increase workout intensity to overcome the cortisol",
      "Switch to only strength training"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Chen recommended replacing two intense sessions with gentler activities like yoga or walking, and adding meditation to help lower cortisol levels.",
    "hints": [
      "The solution involved reducing intensity",
      "Multiple changes were suggested"
    ],
    "image_urls": [],
    "passage_set_id": "94c6717d-3e2f-4066-a0b8-1570c63dbd65"
  },
  {
    "id": "dbb3f1d1-0916-4915-ba54-e8e10a5d687f",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "Why was Casey feeling hungry at 2 AM despite being exhausted?",
    "question_type": "passage_based",
    "options": [
      "They hadn't eaten enough dinner",
      "Sleep deprivation increases ghrelin (hunger hormone) production",
      "Late-night studying burns extra calories",
      "The body naturally gets hungry at night"
    ],
    "correct_answer_index": 1,
    "explanation": "Jamie explained that sleep deprivation increases ghrelin production, the hunger hormone, as the body tries to get energy from food when it's not getting it from adequate sleep.",
    "hints": [
      "Jamie explained the hormonal reason",
      "It's about the body seeking energy"
    ],
    "image_urls": [],
    "passage_set_id": "2831ec2f-cdbe-4082-9361-3178e04815de"
  },
  {
    "id": "adbae9ff-384f-4786-9aff-8dfe0e7356e3",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "What specific types of foods does the body crave when sleep-deprived, according to Jamie?",
    "question_type": "passage_based",
    "options": [
      "High-protein, low-fat foods",
      "High-calorie, high-carb foods like pizza",
      "Fresh fruits and vegetables",
      "Whatever happens to be in the refrigerator"
    ],
    "correct_answer_index": 1,
    "explanation": "Jamie explained that sleep-deprived people specifically crave high-calorie, high-carb foods, using Casey's pizza consumption as a perfect example of this phenomenon.",
    "hints": [
      "The example was pizza",
      "The body wants quick energy"
    ],
    "image_urls": [],
    "passage_set_id": "2831ec2f-cdbe-4082-9361-3178e04815de"
  },
  {
    "id": "4ecf5289-1c17-4665-9f0d-03c81667f46f",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "According to the study Jamie mentioned, how many extra calories per day do sleep-deprived people consume?",
    "question_type": "passage_based",
    "options": [
      "200 extra calories",
      "385 extra calories",
      "500 extra calories",
      "750 extra calories"
    ],
    "correct_answer_index": 1,
    "explanation": "Jamie cited a study showing that sleep-deprived people eat 385 extra calories per day, mostly from snacks like the pizza Casey was consuming.",
    "hints": [
      "This number matches what's mentioned in the main article",
      "It's a specific research finding"
    ],
    "image_urls": [],
    "passage_set_id": "2831ec2f-cdbe-4082-9361-3178e04815de"
  },
  {
    "id": "67b81f03-b1c0-4b0d-a8b0-793b6066fd00",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d482",
    "question_text": "What benefits did Jamie suggest Casey would see from sleeping more?",
    "question_type": "passage_based",
    "options": [
      "Better grades only",
      "Weight loss and improved memory for studying",
      "More energy for all-nighters",
      "Ability to eat more pizza without consequences"
    ],
    "correct_answer_index": 1,
    "explanation": "Jamie suggested that more sleep would lead to natural weight loss without changing diet, plus improved memory retention for studying - addressing both Casey's health and academic concerns.",
    "hints": [
      "Two main benefits were mentioned",
      "One was about weight, one about academics"
    ],
    "image_urls": [],
    "passage_set_id": "2831ec2f-cdbe-4082-9361-3178e04815de"
  },
  {
    "id": "8a9c5d2f-3b1e-4a7f-9e6d-2c3f8b4e9a1c",
    "created_at": "2024-11-15T10:15:00Z",
    "updated_at": "2024-11-15T10:15:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "The World Health Organization recommends 150 minutes of moderate-intensity aerobic activity per week for basic health benefits.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "True. The WHO guidelines recommend exactly 150 minutes of moderate-intensity aerobic activity per week, which breaks down to about 22 minutes per day. This is considered the minimum effective dose for significant health improvements.",
    "hints": [
      "Think about the basic weekly recommendation mentioned in the article",
      "This translates to about 22 minutes of activity per day"
    ],
    "image_urls": []
  },
  {
    "id": "7f8e4d3b-2a9c-4e1f-8d7b-1a5c9f3e8b2d",
    "created_at": "2024-11-15T10:16:00Z",
    "updated_at": "2024-11-15T10:16:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "Research shows that just 15 minutes of moderate exercise per day can reduce mortality risk by 14% and increase life expectancy by 3 years.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "True. This is a key finding from a landmark study published in the British Medical Journal. The research demonstrates that even minimal amounts of exercise provide substantial health benefits, with the biggest gains coming from going from zero activity to some activity.",
    "hints": [
      "Consider the research mentioned about going from zero to some activity",
      "The biggest health gains come from the first bit of exercise you add"
    ],
    "image_urls": []
  },
  {
    "id": "6d5c2a8f-1e9b-4c7d-9f2e-3b8a1c5f7e9d",
    "created_at": "2024-11-15T10:17:00Z",
    "updated_at": "2024-11-15T10:17:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "The minimum effective dose for strength training requires daily sessions to see meaningful results.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The article clearly states that strength training minimums are just 2 sessions per week, 20-30 minutes per session, with 8-10 exercises covering major muscle groups. Even just one set initially can maintain and build muscle mass, especially for beginners.",
    "hints": [
      "Think about how often the article says you need to strength train",
      "The minimum is much less frequent than daily sessions"
    ],
    "image_urls": []
  },
  {
    "id": "1e923a2a-fa83-4a53-ae3e-bf70507a7171",
    "created_at": "2024-11-15T10:18:00Z",
    "updated_at": "2024-11-15T10:18:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "Exercise snacking with brief bursts of activity throughout the day provides no meaningful fitness benefits.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The article extensively discusses exercise snacking as an effective approach, noting that taking stairs for 60 seconds three times per day improves cardiovascular fitness, and even 4-second all-out cycling sprints can improve fitness when done correctly.",
    "hints": [
      "Consider what the article says about brief bursts of activity",
      "Think about the stair climbing example mentioned"
    ],
    "image_urls": []
  },
  {
    "id": "22e0a796-3ed7-4576-b2b1-55fe9cfe0a3a",
    "created_at": "2024-11-15T10:19:00Z",
    "updated_at": "2024-11-15T10:19:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "When working with minimum effective doses of exercise, what principle becomes more important than duration?",
    "question_type": "standalone",
    "options": [
      "Frequency of workouts",
      "Intensity of effort",
      "Type of equipment used",
      "Wearing proper workout clothes"
    ],
    "correct_answer_index": 1,
    "explanation": "Intensity becomes more important than duration when working with minimum doses. The article explains that shorter durations require higher intensity, citing examples like the 4-minute Tabata protocol and 7-minute workouts that provide benefits through concentrated effort.",
    "hints": [
      "Think about what makes short workouts effective",
      "The article mentions that shorter workouts require something specific to be effective"
    ],
    "image_urls": []
  },
  {
    "id": "ad842eb5-5f63-4eca-b74c-d7e55a1aab39",
    "created_at": "2024-11-15T10:20:00Z",
    "updated_at": "2024-11-15T10:20:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "According to the article, what is the most important factor for beginners when it comes to exercise frequency?",
    "question_type": "standalone",
    "options": [
      "Exercising every single day without breaks",
      "Training frequency matters more than individual session intensity",
      "Long workout sessions once per week",
      "Copying advanced athletes' routines exactly"
    ],
    "correct_answer_index": 1,
    "explanation": "The article specifically states that 'research shows that training frequency matters more than individual session intensity for beginners.' This is because your body adapts to consistent signals rather than occasional shock treatments.",
    "hints": [
      "Consider what the research says about beginners specifically",
      "Think about consistency versus intensity for new exercisers"
    ],
    "image_urls": []
  },
  {
    "id": "8b4e9f2c-6d1a-3e7f-9c5b-2a6d8f4e1c7b",
    "created_at": "2024-11-15T10:21:00Z",
    "updated_at": "2024-11-15T10:21:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "Which activity pattern would be most effective for someone just starting their fitness journey?",
    "question_type": "standalone",
    "options": [
      "One 3-hour workout session per week",
      "Daily 15-minute walks with consistency",
      "Sporadic intense workouts when motivated",
      "Weekend warrior approach with 2 long sessions"
    ],
    "correct_answer_index": 1,
    "explanation": "Daily 15-minute walks with consistency would be most effective. The article emphasizes that consistency beats intensity for beginners, and that even 15 minutes daily provides significant health benefits while building sustainable habits.",
    "hints": [
      "Think about what the article says about consistency",
      "Consider which approach is most sustainable for beginners"
    ],
    "image_urls": []
  },
  {
    "id": "5c9a3f7d-2e8b-4f1c-8d6a-9b3e7f1c5a8d",
    "created_at": "2024-11-15T10:22:00Z",
    "updated_at": "2024-11-15T10:22:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "The famous Tabata protocol is effective because it demonstrates that short workouts can provide benefits, but it requires very low intensity to work safely.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The Tabata protocol requires very HIGH intensity, not low intensity. It consists of 20 seconds of all-out effort followed by 10 seconds of rest, repeated 8 times. The article explains that shorter durations require higher intensity to be effective.",
    "hints": [
      "Consider what makes the 4-minute Tabata protocol work",
      "Think about the relationship between duration and intensity"
    ],
    "image_urls": []
  },
  {
    "id": "333bb2a9-ac75-47db-9ce9-aa8f754b72d4",
    "created_at": "2024-11-15T10:23:00Z",
    "updated_at": "2024-11-15T10:23:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "What should be your approach when determining your personal minimum effective dose?",
    "question_type": "standalone",
    "options": [
      "Copy what works for elite athletes",
      "Start where you are and match intensity to your current capacity and available time",
      "Always push to maximum intensity regardless of fitness level",
      "Follow social media fitness influencers' daily routines"
    ],
    "correct_answer_index": 1,
    "explanation": "The article emphasizes starting where you are and matching intensity to your capacity. It states that your minimum effective dose is personal and depends on your current fitness level, health status, available time, goals, and preferences.",
    "hints": [
      "Think about what makes the minimum effective dose 'personal'",
      "Consider the factors that determine your individual starting point"
    ],
    "image_urls": []
  },
  {
    "id": "3f8e1c5a-7d9b-2e4f-8c6a-4b7e9f3c1a8d",
    "created_at": "2024-11-15T10:24:00Z",
    "updated_at": "2024-11-15T10:24:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "According to the article, which combination represents the minimum strength training requirements that can still maintain muscle mass?",
    "question_type": "standalone",
    "options": [
      "Daily sessions with multiple sets",
      "5 days per week, 1 hour each session",
      "2 sessions per week, single sets of 8-12 repetitions",
      "3 sessions per week with only cardio equipment"
    ],
    "correct_answer_index": 2,
    "explanation": "The article states that twice-weekly, 20-minute strength routines with single sets of 8-12 repetitions can maintain and even build muscle mass, especially for beginners. This represents the true minimum effective dose for strength training.",
    "hints": [
      "Look for the specific frequency and set requirements mentioned",
      "Consider what the article says about beginners and muscle building"
    ],
    "image_urls": []
  },
  {
    "id": "4ba9f8f2-b58c-4b60-8cbb-7f2b057c5223",
    "created_at": "2024-11-15T10:25:00Z",
    "updated_at": "2024-11-15T10:25:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "The minimum effective dose concept encourages people to do the least possible amount of exercise to avoid any real effort.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The article clarifies that the minimum effective dose 'isn't about being lazy; it's about being strategic and realistic with your time and energy.' It's about finding the smallest amount needed for meaningful results, not about avoiding effort entirely.",
    "hints": [
      "Consider the article's explanation of what the minimum effective dose actually means",
      "Think about whether this concept promotes laziness or strategic thinking"
    ],
    "image_urls": []
  },
  {
    "id": "02adbd3e-7a97-4f38-9b5d-703ae6c39ba9",
    "created_at": "2024-11-15T10:26:00Z",
    "updated_at": "2024-11-15T10:26:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "Sarah was feeling anxious about returning to exercise after missing nearly two weeks due to work. Her colleague Emma suggested she try 'exercise snacking' during busy periods. What is the main benefit of this approach for someone in Sarah's situation?",
    "question_type": "passage_based",
    "options": [
      "It allows her to burn maximum calories in minimum time",
      "It prevents the all-or-nothing mindset and maintains exercise momentum",
      "It eliminates the need for any gym equipment",
      "It guarantees immediate visible physical changes"
    ],
    "correct_answer_index": 1,
    "explanation": "Exercise snacking helps prevent the all-or-nothing mindset that Sarah was experiencing. Emma's approach shows that short bursts of activity can maintain fitness momentum during busy periods, preventing the feeling of 'falling off the wagon' entirely.",
    "hints": [
      "Think about Sarah's emotional state and her fear of having failed",
      "Consider how Emma's approach addresses the psychological aspect of consistency"
    ],
    "image_urls": [],
    "passage_set_id": "149ece10-a62c-4935-af65-d9abed9a88f6"
  },
  {
    "id": "2db7f335-2703-4808-8fa4-43443d25227d",
    "created_at": "2024-11-15T10:27:00Z",
    "updated_at": "2024-11-15T10:27:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "When Emma suggested that Sarah's body 'doesn't know if you're in gym clothes or work clothes when you're moving,' what principle was she illustrating?",
    "question_type": "passage_based",
    "options": [
      "Exercise only counts if done in proper athletic wear",
      "Physical activity provides benefits regardless of the setting or duration",
      "Work clothes prevent effective exercise",
      "Only gym workouts provide real fitness benefits"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma was illustrating that physical activity provides benefits regardless of setting, clothing, or formality. This aligns with the minimum effective dose principle that any movement counts and that exercise doesn't have to be formal or lengthy to be beneficial.",
    "hints": [
      "Consider the broader message about what counts as exercise",
      "Think about the minimum effective dose principle in everyday contexts"
    ],
    "image_urls": [],
    "passage_set_id": "149ece10-a62c-4935-af65-d9abed9a88f6"
  },
  {
    "id": "82cdb342-a07c-4cfb-ae6d-18036521ce50",
    "created_at": "2024-11-15T10:28:00Z",
    "updated_at": "2024-11-15T10:28:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "Based on Emma's experience maintaining fitness 'through my daughter's entire toddler phase with mostly exercise snacking,' what can we conclude about consistency versus intensity?",
    "question_type": "passage_based",
    "options": [
      "High-intensity workouts are required for maintaining fitness",
      "Parents cannot maintain fitness due to time constraints",
      "Consistent small efforts can be more sustainable than sporadic intense sessions",
      "Exercise snacking is only effective for people without children"
    ],
    "correct_answer_index": 2,
    "explanation": "Emma's experience demonstrates that consistent small efforts (exercise snacking) can be more sustainable than sporadic intense sessions, especially during challenging life phases. Her success maintaining fitness through parenthood illustrates the power of the minimum effective dose approach.",
    "hints": [
      "Consider how Emma managed to maintain fitness during a demanding life phase",
      "Think about what this suggests about sustainable exercise approaches"
    ],
    "image_urls": [],
    "passage_set_id": "149ece10-a62c-4935-af65-d9abed9a88f6"
  },
  {
    "id": "26997e68-0480-4476-9a6e-6ac8d513d972",
    "created_at": "2024-11-15T10:29:00Z",
    "updated_at": "2024-11-15T10:29:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "What was the key insight Sarah gained from her conversation with Emma about exercise during busy periods?",
    "question_type": "passage_based",
    "options": [
      "She needed to cancel her gym membership immediately",
      "Perfect workout plans that can't be executed are worthless compared to imperfect but doable activities",
      "Exercise is impossible during busy work periods",
      "Only people with flexible schedules can maintain fitness"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah's key insight was Emma's point that 'Three minutes of vigorous activity is infinitely better than zero minutes of perfect workout plans you can't execute.' This illustrates the core principle of the minimum effective dose - that doing something consistently is better than planning perfection that never happens.",
    "hints": [
      "Focus on Emma's mathematical comparison about minutes of activity",
      "Consider the contrast between perfect plans and imperfect execution"
    ],
    "image_urls": [],
    "passage_set_id": "149ece10-a62c-4935-af65-d9abed9a88f6"
  },
  {
    "id": "2f7e9c4a-8d1b-5e3f-9c7a-4b8e2f6c9a5d",
    "created_at": "2024-11-15T10:30:00Z",
    "updated_at": "2024-11-15T10:30:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "Jordan's perfectionist approach initially caused them to resist the trainer's suggestion of only TWO strength sessions per week. What was the trainer's main argument for this minimum approach?",
    "question_type": "passage_based",
    "options": [
      "Two sessions are the maximum the human body can handle",
      "Research shows this maintains muscle mass, and consistency beats perfect programs that don't get executed",
      "Jordan was too out of shape for more frequent training",
      "The gym doesn't allow members to train more than twice weekly"
    ],
    "correct_answer_index": 1,
    "explanation": "The trainer's argument was based on research showing that two 20-minute sessions weekly can maintain muscle mass and even allow for small gains. More importantly, the trainer emphasized that 'Two 20-minute sessions you actually do beat five perfect sessions that only exist in your spreadsheet.'",
    "hints": [
      "Consider what the trainer said about research on muscle maintenance",
      "Think about the comparison between theoretical perfect programs and actual execution"
    ],
    "image_urls": [],
    "passage_set_id": "3a6bbc4f-38fc-4217-bb85-3de210c898dc"
  },
  {
    "id": "a9609e34-b108-42da-9f59-1754c5fc3e02",
    "created_at": "2024-11-15T10:31:00Z",
    "updated_at": "2024-11-15T10:31:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "What research findings did the trainer share with Jordan about the minimum effective dose for exercise?",
    "question_type": "passage_based",
    "options": [
      "Single sets twice weekly maintain muscle mass, and 15 minutes daily activity reduces mortality by 14%",
      "Only high-volume training programs produce results",
      "Exercise must be done daily to be effective",
      "Perfectionist approaches always yield better results"
    ],
    "correct_answer_index": 0,
    "explanation": "The trainer cited two key research findings: single sets of 8-12 reps, twice weekly, maintain muscle mass; and the British Medical Journal found that 15 minutes of daily activity reduces mortality by 14%. These studies support the minimum effective dose approach.",
    "hints": [
      "Look for the specific research citations the trainer mentioned",
      "Consider both the strength training and general activity findings"
    ],
    "image_urls": [],
    "passage_set_id": "3a6bbc4f-38fc-4217-bb85-3de210c898dc"
  },
  {
    "id": "ecaeb179-e1d6-495f-9cf1-45192a939127",
    "created_at": "2024-11-15T10:32:00Z",
    "updated_at": "2024-11-15T10:32:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "How did Jordan's analytical mindset initially work against them in adopting the minimum effective dose approach?",
    "question_type": "passage_based",
    "options": [
      "They couldn't understand the scientific concepts",
      "They wanted perfect optimization with detailed periodization, but achieved zero complete workouts due to all-or-nothing thinking",
      "They preferred emotional decision-making over data",
      "They were too lazy to follow any program"
    ],
    "correct_answer_index": 1,
    "explanation": "Jordan's perfectionist, analytical nature led them to create elaborate programs with 'proper periodization' and detailed tracking, but this all-or-nothing approach resulted in zero completed workouts when life got busy. Their desire for optimization prevented them from taking action.",
    "hints": [
      "Consider how Jordan's perfectionism led to paralysis",
      "Think about what actually got accomplished versus what was planned"
    ],
    "image_urls": [],
    "passage_set_id": "3a6bbc4f-38fc-4217-bb85-3de210c898dc"
  },
  {
    "id": "7e3f9c1a-5d8b-4f2c-8e6a-1b5e8f3c7a9d",
    "created_at": "2024-11-15T10:33:00Z",
    "updated_at": "2024-11-15T10:33:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d483",
    "question_text": "What was the trainer's key message to Jordan about the minimum effective dose philosophy?",
    "question_type": "passage_based",
    "options": [
      "Laziness is the best approach to fitness",
      "The minimum effective dose is about being sustainable, not lazy - actual execution beats perfect planning",
      "Only beginners should use minimum effective doses",
      "Spreadsheets are more important than actual workouts"
    ],
    "correct_answer_index": 1,
    "explanation": "The trainer emphasized that 'The minimum effective dose isn't about being lazy, it's about being sustainable.' The key message was that execution matters more than perfection - actual consistent workouts beat elaborate plans that remain theoretical.",
    "hints": [
      "Focus on the trainer's definition of what minimum effective dose really means",
      "Consider the contrast between sustainability and laziness"
    ],
    "image_urls": [],
    "passage_set_id": "3a6bbc4f-38fc-4217-bb85-3de210c898dc"
  },
  {
    "id": "a3afe127-be66-43ca-b2a3-9b6752c54d5a",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "After age 30, most people lose 3-8% of their muscle mass per decade, and this rate doubles after 60.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "This is correct. Sarcopenia begins around age 30 with a 3-8% loss per decade, accelerating significantly after age 60.",
    "hints": [
      "Consider what the article states about when muscle loss begins",
      "Think about how aging affects the rate of muscle deterioration"
    ],
    "image_urls": []
  },
  {
    "id": "d81bda68-a43c-4061-983e-16cc7a28ef9a",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "Each pound of muscle burns approximately 50-100 calories per day at rest.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. Each pound of muscle burns about 6-10 calories per day at rest, not 50-100. This is still significant when considering losing 10+ pounds of muscle over time.",
    "hints": [
      "The article mentions the calorie burn rate per pound of muscle",
      "Consider realistic metabolic numbers rather than inflated claims"
    ],
    "image_urls": []
  },
  {
    "id": "e5e7bf12-49de-461c-813e-66fd412c4c8c",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "People over 50 need the same amount of protein as younger adults because muscle building capacity doesn't change with age.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. After 50, muscles become less responsive to protein (anabolic resistance), requiring more protein - 1-1.2g per pound versus 0.8-1g for younger adults.",
    "hints": [
      "The article discusses 'anabolic resistance' in older adults",
      "Consider how protein requirements change with age"
    ],
    "image_urls": []
  },
  {
    "id": "22ea0bde-c180-4d8b-b089-bc426923d0c3",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "It's too late to build muscle once you reach your 60s and beyond.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. Studies show that even people in their 90s can gain muscle with proper training. It's never too late to start strength training.",
    "hints": [
      "The article mentions research on very elderly individuals",
      "Consider the 'never too late' principle discussed"
    ],
    "image_urls": []
  },
  {
    "id": "d8b1dede-21d1-4ab5-a571-dae180a53b87",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "What is the most effective way to prevent sarcopenia?",
    "question_type": "standalone",
    "options": [
      "Doing only cardio exercise consistently",
      "Taking muscle-building supplements without exercise",
      "Regular resistance training at least twice weekly",
      "Teaching your muscles interpretive dance"
    ],
    "correct_answer_index": 2,
    "explanation": "Regular resistance training at least twice weekly is the most effective prevention. While cardio is beneficial, it doesn't provide the muscle-building stimulus needed to combat sarcopenia.",
    "hints": [
      "Think about what type of exercise specifically builds muscle",
      "Consider the minimum effective dose mentioned in the article"
    ],
    "image_urls": []
  },
  {
    "id": "7b2349f4-72b8-42c1-89dd-3f5ad3ac7fd2",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "Which health issue is NOT directly linked to muscle loss according to the article?",
    "question_type": "standalone",
    "options": [
      "Increased diabetes risk",
      "Higher fall risk and bone fractures",
      "Hair color changes",
      "Slower metabolism and weight gain"
    ],
    "correct_answer_index": 2,
    "explanation": "Hair color changes are not mentioned as being linked to muscle loss. The article discusses diabetes risk, fall risk, bone health, and metabolic impacts as consequences of sarcopenia.",
    "hints": [
      "Review the 'domino effect' section of the article",
      "Consider which option seems unrelated to muscle function"
    ],
    "image_urls": []
  },
  {
    "id": "c5d73b5b-3e7f-4cf5-926c-7dd69e49e5c0",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "According to the article, what should be the focus for people in their 20s and 30s regarding sarcopenia?",
    "question_type": "standalone",
    "options": [
      "Begin taking preventive medications",
      "Focus only on cardio to prepare for later strength training",
      "Build muscle 'bank account' aggressively while young",
      "Ignore it completely since muscle loss doesn't start until 50"
    ],
    "correct_answer_index": 2,
    "explanation": "The article emphasizes building a muscle 'bank account' aggressively in your 20s and 30s, comparing it to compound interest for your body's future.",
    "hints": [
      "The article uses a financial metaphor for young adult muscle building",
      "Consider the 'critical investment window' concept"
    ],
    "image_urls": []
  },
  {
    "id": "c7531c71-b3e3-46c5-88db-64c724cc48f4",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "Why does the article recommend eating protein throughout the day rather than all at once?",
    "question_type": "standalone",
    "options": [
      "It tastes better when spread out",
      "Muscles can't store protein for later like carbs or fat",
      "It's easier on the digestive system",
      "It helps you feel full all day"
    ],
    "correct_answer_index": 1,
    "explanation": "Muscles can't store protein for later use like they can with carbs or fat, making distribution throughout the day important for optimal muscle protein synthesis.",
    "hints": [
      "Think about how the article describes protein storage capacity",
      "Consider the difference between protein and other macronutrients"
    ],
    "image_urls": []
  },
  {
    "id": "15d3540e-d43f-49d6-b399-be681788680b",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "Which sequence correctly matches the functional exercises with their real-life applications?",
    "question_type": "standalone",
    "options": [
      "Squats → picking things up, Deadlifts → getting up from chairs",
      "Squats → getting up from chairs, Deadlifts → picking things up safely",
      "Squats → opening doors, Deadlifts → putting items on shelves",
      "Squats → climbing stairs, Deadlifts → walking with groceries"
    ],
    "correct_answer_index": 1,
    "explanation": "Squats/sit-to-stands help with getting up from chairs and toilets, while deadlifts/hip hinges help with picking things up safely from the ground.",
    "hints": [
      "Think about the movement patterns involved in each exercise",
      "Consider which daily activities match these movement patterns"
    ],
    "image_urls": []
  },
  {
    "id": "71597479-ec78-470c-9eb4-f8431c6dfaeb",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "What combination of warning signs should prompt someone to take action against sarcopenia?",
    "question_type": "standalone",
    "options": [
      "Difficulty with jar lids + needing arm support to stand + avoiding stairs",
      "Getting tired after meals + preferring warm weather + sleeping longer",
      "Choosing different clothing styles + changing hair preferences + new hobbies",
      "Increased appetite + better sleep + more social activities"
    ],
    "correct_answer_index": 0,
    "explanation": "Struggling with jar lids (grip strength decline), needing arm support to stand, and avoiding stairs are all functional red flags indicating muscle loss and should prompt action.",
    "hints": [
      "Look for signs related to physical function and strength",
      "Consider which options indicate declining physical capability"
    ],
    "image_urls": []
  },
  {
    "id": "d57b5a48-2ca2-4937-b054-0dac64e50024",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "How do strength training recommendations differ across age groups according to the article?",
    "question_type": "standalone",
    "options": [
      "Under 40: 1-2 sessions, 40-60: 2-3 sessions, Over 60: 3-4 sessions",
      "Under 40: 3-4 sessions, 40-60: 2-3 sessions, Over 60: fight for every fiber",
      "All age groups: exactly 2 sessions per week",
      "Under 40: cardio only, 40-60: light weights, Over 60: avoid exercise"
    ],
    "correct_answer_index": 1,
    "explanation": "The article recommends 3-4 sessions for under 40 (building phase), 2-3 for 40-60 (maintenance), and emphasizes 'fighting for every fiber' over 60 (preservation).",
    "hints": [
      "Consider how the goals change with age: building vs maintaining vs preserving",
      "Look at the age-specific action plan in the article"
    ],
    "image_urls": []
  },
  {
    "id": "7387d81f-4b05-4b73-965c-919739ea4367",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "In the first passage, what made Taylor finally consider taking action against sarcopenia?",
    "question_type": "passage_based",
    "options": [
      "Learning about the financial costs of muscle loss",
      "Seeing the comparison photos and thinking about their mother's assisted living situation",
      "Being told they needed expensive medical treatments",
      "Realizing they were already too late to make changes"
    ],
    "correct_answer_index": 1,
    "explanation": "Taylor was motivated by seeing the comparison photos of two 70-year-olds and thinking about their mother who moved to assisted living at 72 after a fall.",
    "hints": [
      "Focus on what personally resonated with Taylor in the passage",
      "Consider the family connection that made the issue real"
    ],
    "image_urls": [],
    "passage_set_id": "0bbdd8de-4807-4f26-8c20-7ec07f3e22f3"
  },
  {
    "id": "ee0667ec-5f82-4450-8c59-c0e2c2619794",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "What specific starting recommendations did Dr. Chen give to Taylor for beginning strength training?",
    "question_type": "passage_based",
    "options": [
      "Join a gym immediately and start heavy lifting",
      "Begin with bodyweight exercises, resistance bands, and increase protein to 30g per meal",
      "Take supplements first, then consider exercise later",
      "Wait until blood pressure improves before starting any exercise"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Chen recommended starting with bodyweight exercises, resistance bands, and increasing protein to 30g per meal as a beginner-friendly approach.",
    "hints": [
      "Look for the specific, actionable advice the doctor provided",
      "Consider what would be appropriate for someone new to strength training"
    ],
    "image_urls": [],
    "passage_set_id": "0bbdd8de-4807-4f26-8c20-7ec07f3e22f3"
  },
  {
    "id": "720cc075-80c3-43a1-a1c8-f980b50c066d",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "How did Dr. Chen reframe strength training for Taylor?",
    "question_type": "passage_based",
    "options": [
      "As an optional hobby for when they have more time",
      "As medicine and the most effective prescription for their future self",
      "As something only young people should do",
      "As a way to impress others at the gym"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Chen told Taylor to 'think of it as medicine' and called it 'the most effective prescription I can write for your future self.'",
    "hints": [
      "Focus on how the doctor positioned the importance of strength training",
      "Look for the medical metaphor used to emphasize necessity"
    ],
    "image_urls": [],
    "passage_set_id": "0bbdd8de-4807-4f26-8c20-7ec07f3e22f3"
  },
  {
    "id": "87023cd6-4c1e-4acf-b427-617f92bc608d",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "What was Taylor's initial concern about starting strength training, and how was it addressed?",
    "question_type": "passage_based",
    "options": [
      "They were worried about the cost, so the doctor recommended free alternatives",
      "They had never lifted weights before, so the doctor suggested starting with simple exercises",
      "They thought they were too old, so the doctor showed age isn't a barrier",
      "They lacked time, so the doctor created a shorter program"
    ],
    "correct_answer_index": 1,
    "explanation": "Taylor said 'What if I've never lifted weights?' and Dr. Chen addressed this by suggesting they start with bodyweight exercises and resistance bands.",
    "hints": [
      "Identify Taylor's specific worry about their experience level",
      "Look at how the doctor provided an accessible starting point"
    ],
    "image_urls": [],
    "passage_set_id": "0bbdd8de-4807-4f26-8c20-7ec07f3e22f3"
  },
  {
    "id": "df8692f8-94df-49dd-bb62-1e3a85af5582",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "According to Sarah's research in the second passage, what does grip strength predict?",
    "question_type": "passage_based",
    "options": [
      "How much someone exercises per week",
      "Longevity better than blood pressure",
      "Whether someone will enjoy strength training",
      "The likelihood of developing arthritis"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah told her mother that 'grip strength predicts longevity better than blood pressure' when explaining why the jar lid struggle was concerning.",
    "hints": [
      "Focus on the specific statistic Sarah shared with her mother",
      "Consider why grip strength is such an important health indicator"
    ],
    "image_urls": [],
    "passage_set_id": "81217c2e-3114-4a3c-a4de-e54b8a99a26c"
  },
  {
    "id": "b8181094-c1ff-4008-b606-ea404efe678d",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "What was Margaret's motivation for strength training according to Sarah?",
    "question_type": "passage_based",
    "options": [
      "To lose weight for a special event",
      "To compete with other women her age",
      "To add life to her years, not years to her life",
      "To prove doctors wrong about her limitations"
    ],
    "correct_answer_index": 2,
    "explanation": "Sarah quoted Margaret saying she 'doesn't strength train to add years to her life, but to add life to her years.'",
    "hints": [
      "Look for Margaret's personal philosophy about why she exercises",
      "Consider the quality vs quantity of life distinction"
    ],
    "image_urls": [],
    "passage_set_id": "81217c2e-3114-4a3c-a4de-e54b8a99a26c"
  },
  {
    "id": "c5668668-bb5f-42da-9f96-d44f3366cc0b",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "What was Sarah's mother's initial excuse for not doing strength training?",
    "question_type": "passage_based",
    "options": [
      "She said it was too expensive to join a gym",
      "She believed strength training was only for young people",
      "She claimed she was too busy with other activities",
      "She thought her walking routine was sufficient"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah's mother said 'Oh, that's for young people. I do my walking' when asked about strength training.",
    "hints": [
      "Look at the mother's immediate response to the strength training suggestion",
      "Consider the age-related assumption she made"
    ],
    "image_urls": [],
    "passage_set_id": "81217c2e-3114-4a3c-a4de-e54b8a99a26c"
  },
  {
    "id": "436d2e26-bf41-4293-bb7f-5980c0c1bde5",
    "created_at": "2024-01-15T10:00:00Z",
    "updated_at": "2024-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d484",
    "question_text": "How did Sarah plan to help her mother overcome her hesitation about strength training?",
    "question_type": "passage_based",
    "options": [
      "By hiring a personal trainer for her mother",
      "By offering to do resistance band training together",
      "By buying her mother expensive gym equipment",
      "By showing her medical studies about strength training"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah offered 'I'll do it with you' when her mother considered trying resistance bands, providing social support and accountability.",
    "hints": [
      "Look for how Sarah made the activity less intimidating",
      "Consider the power of social support in starting new habits"
    ],
    "image_urls": [],
    "passage_set_id": "81217c2e-3114-4a3c-a4de-e54b8a99a26c"
  },
  {
    "id": "c2036a5d-b172-48e0-91b1-5a252a73dbbd",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "Getting medical clearance before starting exercise with a health condition is just a legal formality and not medically necessary.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "Medical clearance is absolutely medically necessary, not just a legal formality. It helps create a safe, effective plan tailored to your specific condition and ensures you understand what exercises to avoid and warning signs to watch for.",
    "hints": [
      "The article emphasizes this as your 'non-negotiable first step'",
      "Medical clearance helps identify safe exercises and warning signs specific to your condition"
    ],
    "image_urls": []
  },
  {
    "id": "632053e7-aef9-43af-b858-7bcf51705497",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "People with high blood pressure should completely avoid strength training because it raises blood pressure.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "This is false. People with high blood pressure can safely do strength training with modifications like using lighter weights with more repetitions and avoiding holding their breath. The key is adapting the exercise, not avoiding it entirely.",
    "hints": [
      "The article mentions modifications like lighter weights and more repetitions",
      "The focus is on adapting exercise safely, not eliminating it"
    ],
    "image_urls": []
  },
  {
    "id": "358c82a7-805a-437d-a4e7-69b3127337c2",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "Exercise can be as effective as some antidepressant medications for treating mild to moderate depression.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "This is true. The article specifically states that exercise is proven as effective as some antidepressants for mild-moderate depression, though it emphasizes never stopping psychiatric medications without medical supervision.",
    "hints": [
      "The article mentions exercise effectiveness for depression treatment",
      "Remember the importance of medical supervision for medication changes"
    ],
    "image_urls": []
  },
  {
    "id": "bc664f5f-0c67-4aab-ba4f-d55253fb8303",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "The 'no pain, no gain' mentality is especially important to follow when exercising with chronic health conditions.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "This is false. The article explicitly states that the 'no pain, no gain' mentality doesn't apply when you have health conditions. Discomfort is okay, but pain is not. People with health conditions need to listen more carefully to their bodies.",
    "hints": [
      "The article specifically warns against this mentality for people with health conditions",
      "Think about the difference between discomfort and actual pain"
    ],
    "image_urls": []
  },
  {
    "id": "a0f2bdaf-fc67-4c4c-b5cf-20a2fd26973e",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What is the most important first step before starting an exercise program with any health condition?",
    "question_type": "standalone",
    "options": [
      "Getting medical clearance from your doctor",
      "Buying expensive adaptive equipment",
      "Joining a specialized gym for people with health conditions",
      "Training to become a medical exercise expert yourself"
    ],
    "correct_answer_index": 0,
    "explanation": "Getting medical clearance is the most important first step. The article emphasizes this as 'non-negotiable' and helps create a safe, effective plan tailored to your specific situation.",
    "hints": [
      "The article calls this the 'non-negotiable first step'",
      "This step helps ensure safety and creates a personalized plan"
    ],
    "image_urls": []
  },
  {
    "id": "ae956914-1f93-445b-ba0c-a22086a76a55",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "Which exercise modification is recommended for people with arthritis?",
    "question_type": "standalone",
    "options": [
      "Only high-impact exercises to strengthen joints quickly",
      "Low-impact activities like swimming and water aerobics",
      "Avoiding all movement to prevent joint damage",
      "Competitive powerlifting to build maximum strength"
    ],
    "correct_answer_index": 1,
    "explanation": "Low-impact activities like swimming and water aerobics are recommended for arthritis because they reduce joint stress while still providing exercise benefits. Movement actually helps reduce joint pain and stiffness over time.",
    "hints": [
      "Think about activities that are gentle on the joints",
      "The article mentions that movement actually reduces joint pain over time"
    ],
    "image_urls": []
  },
  {
    "id": "c1419d5e-e578-40d5-9c63-ac3068c064e9",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What should people with Type 2 diabetes do before, during, and after exercise?",
    "question_type": "standalone",
    "options": [
      "Take extra insulin and avoid all carbohydrates",
      "Check blood sugar and keep fast-acting carbs handy",
      "Only exercise in hospitals with medical supervision",
      "Avoid exercise completely due to blood sugar risks"
    ],
    "correct_answer_index": 1,
    "explanation": "People with diabetes should check blood sugar before, during (if over 30 minutes), and after exercise, and keep fast-acting carbs like glucose tablets handy in case of low blood sugar episodes.",
    "hints": [
      "Think about monitoring and preparing for blood sugar changes",
      "Consider what to have ready in case blood sugar drops too low"
    ],
    "image_urls": []
  },
  {
    "id": "c2c31fa1-3ac7-47cd-aea5-5ed8e1442bc9",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "Which warning signs during exercise require immediate medical attention for people with chronic back pain?",
    "question_type": "standalone",
    "options": [
      "Mild muscle fatigue and normal sweating",
      "Numbness, tingling, or loss of bladder control",
      "Slight increase in heart rate during activity",
      "Feeling energized and wanting to exercise longer"
    ],
    "correct_answer_index": 1,
    "explanation": "Numbness, tingling, or loss of bladder control are serious warning signs that require immediate medical attention as they may indicate nerve involvement or serious spinal issues.",
    "hints": [
      "Look for symptoms that involve nerve function",
      "These are the 'red flags' mentioned in the back pain section"
    ],
    "image_urls": []
  },
  {
    "id": "ebdfcb68-fa8c-4b6c-813b-e296cdec3dd7",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What is the correct sequence of universal adaptation principles for exercising with health conditions?",
    "question_type": "standalone",
    "options": [
      "Start high, progress fast, ignore body signals, maintain rigid plans, track minimally",
      "Start lower, progress slower, listen harder, plan for bad days, track everything initially",
      "Start anywhere, progress randomly, listen occasionally, avoid planning, never track progress",
      "Start with maximum intensity, progress daily, ignore discomfort, stick to one plan always, track only weight"
    ],
    "correct_answer_index": 1,
    "explanation": "The five universal adaptation principles are: start lower than you think, progress slower than others, listen harder to your body, plan for bad days, and track everything initially to understand patterns.",
    "hints": [
      "Think about being more conservative and careful than healthy individuals",
      "Consider the importance of planning and monitoring when managing health conditions"
    ],
    "image_urls": []
  },
  {
    "id": "f98665ae-922a-4eb2-ad0a-e50b9c9a3b9a",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "Which combination of healthcare professionals would be most beneficial for someone starting exercise with multiple health conditions?",
    "question_type": "standalone",
    "options": [
      "Only a personal trainer and nutritionist",
      "Physical therapist, certified trainer with medical exercise certification, registered dietitian, and mental health professional",
      "Just a doctor and a regular gym membership",
      "Social media fitness influencers and online coaches only"
    ],
    "correct_answer_index": 1,
    "explanation": "The article recommends building a comprehensive healthcare team including a physical therapist for movement assessment, a certified trainer with medical exercise certification, a registered dietitian, and a mental health professional for holistic support.",
    "hints": [
      "Think about the different aspects of health that need professional support",
      "The article emphasizes not having to figure this out alone"
    ],
    "image_urls": []
  },
  {
    "id": "60c803a0-ab1a-4bf6-9022-3a30c605e527",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What are the key steps in the recommended action plan for starting exercise with health conditions?",
    "question_type": "standalone",
    "options": [
      "Schedule doctor appointment, track symptoms, start at 100% intensity, ignore healthcare team, jump into advanced exercises",
      "Schedule doctor appointment, track current activity and symptoms, start at 50% capacity, establish consistency, have regular check-ins",
      "Avoid doctors, start immediately, track only weight, work alone always, never modify the plan",
      "See a doctor once, never track anything, start at random intensity, avoid consistency, skip follow-up appointments"
    ],
    "correct_answer_index": 1,
    "explanation": "The recommended action plan includes: scheduling a doctor appointment for clearance, tracking current activity and symptoms while waiting, starting at 50% of what feels manageable, establishing consistency before increasing intensity, and having ongoing check-ins with your healthcare team.",
    "hints": [
      "Think about a systematic, gradual approach",
      "Consider the importance of ongoing medical supervision"
    ],
    "image_urls": []
  },
  {
    "id": "81644d6e-59db-4cc6-b9c5-de0a7a48d9f0",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "In Taylor's diabetes management journey, what was Marcus's key advice about exercise and blood sugar monitoring?",
    "question_type": "passage_based",
    "options": [
      "Never check blood sugar, just exercise when you feel like it",
      "Check every 30 minutes initially until you know your patterns, and carry glucose tabs, juice, and granola bars",
      "Only check blood sugar once per week regardless of exercise",
      "Avoid all carbohydrates before, during, and after exercise"
    ],
    "correct_answer_index": 1,
    "explanation": "Marcus advised Taylor to check blood sugar every 30 minutes initially until patterns become clear, and to always carry glucose tablets, juice box, and granola bar for safety. He also mentioned that different exercises affect blood sugar differently.",
    "hints": [
      "Marcus had been managing Type 2 diabetes for five years",
      "He emphasized learning individual patterns and always being prepared for low blood sugar"
    ],
    "image_urls": [],
    "passage_set_id": "d5e3c43e-7725-4127-8762-08d409dd2c2c"
  },
  {
    "id": "7ce32b2a-fdd3-4c75-bf05-d6a7ccd85fd4",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What impressive health improvement did Marcus share with Taylor about his diabetes management?",
    "question_type": "passage_based",
    "options": [
      "His weight dropped by 50 pounds in one month",
      "His A1C dropped from 8.2 to 6.1 through exercise",
      "He no longer needed to check his blood sugar",
      "He could eat unlimited sugar without consequences"
    ],
    "correct_answer_index": 1,
    "explanation": "Marcus shared that his A1C (a measure of blood sugar control over 2-3 months) dropped from 8.2 to 6.1 through regular exercise, showing significant improvement in diabetes management.",
    "hints": [
      "A1C is a key measure of blood sugar control over time",
      "This was Marcus's success story after managing diabetes for five years"
    ],
    "image_urls": [],
    "passage_set_id": "d5e3c43e-7725-4127-8762-08d409dd2c2c"
  },
  {
    "id": "f36001e5-44c5-4e73-a663-06eb3f168ecb",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What was Taylor's initial concern about starting exercise with diabetes?",
    "question_type": "passage_based",
    "options": [
      "Worried about gaining too much muscle mass",
      "Concerned about going into low blood sugar during workouts",
      "Afraid of exercising too intensely",
      "Worried about eating too many carbohydrates"
    ],
    "correct_answer_index": 1,
    "explanation": "Taylor was nervous about going into low blood sugar (hypoglycemia) during workouts, which is a valid concern for people with diabetes, especially those new to exercise.",
    "hints": [
      "This is a common and legitimate fear for people with diabetes starting exercise",
      "Think about what happens when blood sugar drops too low during physical activity"
    ],
    "image_urls": [],
    "passage_set_id": "d5e3c43e-7725-4127-8762-08d409dd2c2c"
  },
  {
    "id": "6ddb1e67-e3ff-4214-bbf7-6ccf584a5de1",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "According to Marcus, what was the key principle for managing diabetes through exercise?",
    "question_type": "passage_based",
    "options": [
      "Intensity beats frequency when managing diabetes",
      "Consistency beats intensity when managing diabetes",
      "Only high-intensity exercise helps with blood sugar",
      "Exercise timing doesn't matter for diabetes management"
    ],
    "correct_answer_index": 1,
    "explanation": "Marcus emphasized that 'consistency beats intensity when you're managing diabetes,' highlighting the importance of regular exercise rather than sporadic intense workouts for blood sugar management.",
    "hints": [
      "This was Marcus's key advice to Taylor about exercise and diabetes",
      "Think about what's more important for long-term health management"
    ],
    "image_urls": [],
    "passage_set_id": "d5e3c43e-7725-4127-8762-08d409dd2c2c"
  },
  {
    "id": "82b98243-b71b-46d5-930f-b49ec27aa444",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "Why was water aerobics particularly beneficial for Sarah's rheumatoid arthritis?",
    "question_type": "passage_based",
    "options": [
      "Water makes exercise more challenging and intense",
      "Buoyancy reduces joint stress by up to 90% while providing resistance",
      "Water aerobics requires no physical effort",
      "It's the only exercise safe for people with arthritis"
    ],
    "correct_answer_index": 1,
    "explanation": "Beth, the water aerobics instructor, explained that buoyancy reduces joint stress by up to 90% while the water provides resistance for strength building, making it ideal for people with arthritis.",
    "hints": [
      "Think about the properties of water and how it affects the body",
      "Beth gave specific percentages about joint stress reduction"
    ],
    "image_urls": [],
    "passage_set_id": "5d61892b-1e99-40b5-a0f3-52972a445954"
  },
  {
    "id": "87bce8bc-ae25-4273-a3da-a8a583e43171",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What immediate benefit did Sarah notice during her first water aerobics class?",
    "question_type": "passage_based",
    "options": [
      "She could lift her arms higher than she had in months",
      "She lost significant weight immediately",
      "Her rheumatoid arthritis was completely cured",
      "She could run a marathon"
    ],
    "correct_answer_index": 0,
    "explanation": "Sarah noticed during class that she could lift her arms higher than she had been able to in months, demonstrating the immediate benefit of the warm water and reduced joint stress.",
    "hints": [
      "This was something Sarah noticed and commented on during the class",
      "It related to her range of motion and joint flexibility"
    ],
    "image_urls": [],
    "passage_set_id": "5d61892b-1e99-40b5-a0f3-52972a445954"
  },
  {
    "id": "b745b41b-2849-455f-87b1-61014184dacd",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What was Sarah's initial concern about starting water aerobics?",
    "question_type": "passage_based",
    "options": [
      "She was afraid of drowning",
      "Her rheumatoid arthritis was flaring and land exercises hurt too much",
      "She didn't have proper swimming attire",
      "She thought water exercise would be too easy"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah entered with her rheumatoid arthritis flaring in her hands and knees, and mentioned that land exercises hurt too much, which is why she was trying water aerobics.",
    "hints": [
      "Sarah was experiencing a flare-up when she arrived",
      "She had tried other forms of exercise that caused pain"
    ],
    "image_urls": [],
    "passage_set_id": "5d61892b-1e99-40b5-a0f3-52972a445954"
  },
  {
    "id": "a4b24a49-5693-4fd1-8023-6b603811303e",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "How did Sarah feel about exercise after her water aerobics experience?",
    "question_type": "passage_based",
    "options": [
      "She decided exercise was still impossible with arthritis",
      "For the first time since diagnosis, exercise felt possible and even enjoyable",
      "She thought water aerobics was too difficult",
      "She decided to only do land-based exercises"
    ],
    "correct_answer_index": 1,
    "explanation": "The passage states that 'For the first time since diagnosis, exercise felt possible—even enjoyable' after Sarah's positive water aerobics experience.",
    "hints": [
      "This was Sarah's emotional response after trying water aerobics",
      "It represented a significant shift in her perspective on exercise with arthritis"
    ],
    "image_urls": [],
    "passage_set_id": "5d61892b-1e99-40b5-a0f3-52972a445954"
  },
  {
    "id": "f064861a-ae49-4b3d-b87b-088f31a47892",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 20,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What caused Mike's initial fear about returning to weight training after his back injury?",
    "question_type": "passage_based",
    "options": [
      "He was afraid of gaining too much muscle",
      "A deadlift had triggered his back injury two years ago",
      "He was concerned about his form being perfect",
      "He worried about what other gym members would think"
    ],
    "correct_answer_index": 1,
    "explanation": "Mike was frozen with fear because a deadlift had triggered his back injury two years ago, making him afraid to return to the weight rack.",
    "hints": [
      "Think about what specific exercise had caused his injury",
      "This fear was keeping him from approaching the weights"
    ],
    "image_urls": [],
    "passage_set_id": "403dbf71-1576-4df7-a413-e9f36f44dcff"
  },
  {
    "id": "43913e7e-8cd0-49d5-862e-f5992e2e5d68",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 21,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What exercise did Alex, the medical exercise specialist, start Mike with instead of weights?",
    "question_type": "passage_based",
    "options": [
      "Deadlifts with lighter weight",
      "Bird dog exercises to build core stability",
      "Heavy squats to strengthen his back",
      "High-intensity cardio workouts"
    ],
    "correct_answer_index": 1,
    "explanation": "Alex started Mike with bird dog exercises to build core stability as a foundation before progressing to weights, explaining that Mike's disc issues required core stability work first.",
    "hints": [
      "This was a foundational exercise to build stability",
      "Alex explained it was necessary before adding weights"
    ],
    "image_urls": [],
    "passage_set_id": "403dbf71-1576-4df7-a413-e9f36f44dcff"
  },
  {
    "id": "a39e42e3-f3ec-44ef-a3ae-37c40156bc4d",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 22,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What positive change did Mike notice after three weeks of foundation exercises?",
    "question_type": "passage_based",
    "options": [
      "He could deadlift his original weight again",
      "His back hadn't hurt in four days",
      "He gained 10 pounds of muscle",
      "He could run a marathon"
    ],
    "correct_answer_index": 1,
    "explanation": "After three weeks of foundation exercises, Mike noticed that his back hadn't hurt in four days, which surprised him and showed the effectiveness of the core stability work.",
    "hints": [
      "This was a pain-related improvement Mike noticed",
      "It happened after three weeks of doing the foundation exercises"
    ],
    "image_urls": [],
    "passage_set_id": "403dbf71-1576-4df7-a413-e9f36f44dcff"
  },
  {
    "id": "c6a1c9aa-95c1-4508-b385-0f479e7acb75",
    "created_at": "2024-01-18T10:00:00Z",
    "updated_at": "2024-01-18T10:00:00Z",
    "is_active": true,
    "sort_order": 23,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d485",
    "question_text": "What key lesson did Alex teach Mike about training with back issues?",
    "question_type": "passage_based",
    "options": [
      "He should avoid all weight training permanently",
      "He needs to adapt his training approach rather than avoid exercise completely",
      "He should only do cardio exercises from now on",
      "He needs to push through pain to get stronger"
    ],
    "correct_answer_index": 1,
    "explanation": "Alex taught Mike that he needed to adapt his training approach rather than avoid exercise completely. This helped Mike understand that his comeback wasn't about returning to old habits, but building better, more sustainable ones.",
    "hints": [
      "Think about how Alex's advice changed Mike's approach to training",
      "This lesson helped Mike understand the difference between avoiding exercise and adapting it"
    ],
    "image_urls": [],
    "passage_set_id": "403dbf71-1576-4df7-a413-e9f36f44dcff"
  },
  {
    "id": "27589467-24b3-4d3e-bc07-e074bce79ace",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "The \"all-or-nothing\" approach to fitness leads to better long-term results than moderate consistency.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The article explains that all-or-nothing approaches often result in sporadic exercise patterns, with people exercising intensely once per week but missing other days due to soreness or burnout. Moderate consistency provides more total training volume and better results.",
    "hints": [
      "Think about what happens after an extremely intense workout session",
      "Consider how often someone can realistically maintain maximum effort workouts"
    ],
    "image_urls": []
  },
  {
    "id": "49714dfc-b63e-483f-b9c2-e04da282eea9",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "According to research, training frequency matters more than individual session intensity for beginners.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "True. The article specifically states that research shows training frequency matters more than individual session intensity for beginners, as the body adapts to what you do consistently rather than what you do occasionally.",
    "hints": [
      "Consider how beginners' bodies respond to exercise stimuli",
      "Think about the difference between repeated exposure and occasional shock treatments"
    ],
    "image_urls": []
  },
  {
    "id": "34b797c5-7e8c-4d21-913d-d7ae2705def2",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "The Two-Day Rule means you should never exercise two days in a row to ensure proper recovery.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The Two-Day Rule actually means never let two days pass WITHOUT some form of exercise. This prevents the 'I'll start Monday' spiral and maintains consistency by making the next day non-negotiable if you miss one day.",
    "hints": [
      "Re-read what the Two-Day Rule is designed to prevent",
      "Consider whether this rule promotes or prevents exercise frequency"
    ],
    "image_urls": []
  },
  {
    "id": "914c8638-1c6a-4275-8b14-f3b7ddcf9fd7",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "Each workout is described as 'a vote for the person you're becoming' regardless of intensity level.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "True. The article emphasizes that consistency builds identity, and each workout, regardless of intensity, is a vote for the person you're becoming - someone who shows up and prioritizes health.",
    "hints": [
      "Focus on the identity-building aspect mentioned in the article",
      "Consider how small actions contribute to larger identity formation"
    ],
    "image_urls": []
  },
  {
    "id": "5d4dda30-fee2-4e65-810d-b4d1dd966768",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What happens during the recovery timeline after an intense workout according to the article?",
    "question_type": "standalone",
    "options": [
      "Days 1-2: Complete recovery, Days 3-4: Ready for next intense session",
      "Days 1-2: Acute inflammation and muscle damage, Days 3-4: Peak soreness, Days 5-7: Finally recovering to baseline",
      "Days 1-2: Mild soreness, Days 3-7: Continuous strength building",
      "Days 1-2: Time for victory dancing, Days 3-4: Planning your fitness influencer career"
    ],
    "correct_answer_index": 1,
    "explanation": "The article outlines a 7-day recovery timeline where the first two days involve acute inflammation and muscle damage, days 3-4 show peak soreness (DOMS), and days 5-7 are spent finally recovering to baseline, demonstrating why intense workouts can interfere with consistent training.",
    "hints": [
      "Look for the specific timeline breakdown in the recovery section",
      "Consider why this timeline supports the consistency argument"
    ],
    "image_urls": []
  },
  {
    "id": "8c53f7f4-0602-4012-a69f-e3efce0bdd3b",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "According to the math comparison in the article, what's the realistic completion rate difference between weekend warriors and consistent moderate exercisers?",
    "question_type": "standalone",
    "options": [
      "Weekend warriors: 80% completion, Moderate exercisers: 85% completion",
      "Weekend warriors: 60% completion (~62 workouts), Moderate exercisers: 85% completion (~177 workouts)",
      "Weekend warriors: 90% completion, Moderate exercisers: 75% completion",
      "Weekend warriors: 100% completion because they're obviously superhuman, Moderate exercisers: 50% because they lack intensity"
    ],
    "correct_answer_index": 1,
    "explanation": "The article calculates that weekend warriors achieve about 60% completion rate due to life and soreness (~62 workouts annually), while consistent moderate exercisers achieve 85% completion (~177 workouts annually), resulting in nearly three times more training volume.",
    "hints": [
      "Look for the specific mathematical comparison in the compound effect section",
      "Consider factors like injury risk and burnout that affect completion rates"
    ],
    "image_urls": []
  },
  {
    "id": "6644fbcb-b311-49db-8070-434d372592c2",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What should you do when your energy levels are rated 3-4 out of 10 according to the Energy Matching Principle?",
    "question_type": "standalone",
    "options": [
      "Skip exercise entirely and wait for perfect conditions",
      "Push through with high-intensity training to boost energy",
      "Do light movement with reduced duration",
      "Take a nap and dream about becoming the next fitness influencer"
    ],
    "correct_answer_index": 2,
    "explanation": "The Energy Matching Principle states that when your energy is rated 3-4 out of 10, you should engage in light movement with reduced duration. This keeps you active while respecting your body's current capacity.",
    "hints": [
      "Find the Energy Matching Principle section and its specific recommendations",
      "Consider how this approach maintains consistency while being realistic"
    ],
    "image_urls": []
  },
  {
    "id": "ba4782e9-275e-40a4-a722-8d91ff5a921b",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What is your 'minimum effective dose' according to the article's framework?",
    "question_type": "standalone",
    "options": [
      "The most you can possibly do on your best day",
      "Exactly 45 minutes of intense exercise daily",
      "Your non-negotiable baseline that keeps you in the game on tough days",
      "The amount of exercise that impresses people on social media"
    ],
    "correct_answer_index": 2,
    "explanation": "The article defines your minimum effective dose as your non-negotiable baseline - the amount of exercise you'll do no matter what. This serves as your safety net on tough days, keeping you consistent and 'in the game' rather than breaking the habit entirely.",
    "hints": [
      "Look for the section discussing what minimum effective dose means in practice",
      "Consider the purpose this minimum serves during difficult periods"
    ],
    "image_urls": []
  },
  {
    "id": "988367a2-d2a1-42c7-a243-570f74b273cf",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "Which combination of factors does the article recommend for building consistency?",
    "question_type": "standalone",
    "options": [
      "Same time + prepared gear + ritual start + visible tracking",
      "Maximum intensity + perfect conditions + advanced equipment",
      "Social media posts + expensive gear + complex programming",
      "Sporadic timing + whatever clothes + random activities + secret tracking"
    ],
    "correct_answer_index": 0,
    "explanation": "The article lists four consistency triggers: same time (body learns to expect exercise), prepared gear (removes one decision), ritual start (creates mental transition), and visible tracking (calendar X's provide visual motivation).",
    "hints": [
      "Look for the consistency triggers section",
      "Consider what makes showing up automatic rather than dependent on motivation"
    ],
    "image_urls": []
  },
  {
    "id": "8c43444e-4db6-4afa-8254-380228eddc35",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "According to the flexible programming approach, what should your weekly movement quotas include?",
    "question_type": "standalone",
    "options": [
      "Total minutes (150+) + strength sessions (2-3) + recovery activities (2)",
      "Only high-intensity workouts + zero rest days + maximum effort always",
      "Exactly 7 hours + 5 strength sessions + no recovery time",
      "Instagram-worthy workouts + perfect form always + comparison with others"
    ],
    "correct_answer_index": 0,
    "explanation": "The article suggests thinking in weekly movement quotas: total minutes of activity (aim for 150+), number of strength sessions (aim for 2-3), and recovery activities (aim for 2), allowing you to mix and match based on energy and schedule.",
    "hints": [
      "Find the flexible programming section that discusses weekly quotas",
      "Consider how this approach provides structure while maintaining adaptability"
    ],
    "image_urls": []
  },
  {
    "id": "86a0ddf6-df5a-4d7a-956e-fa502915c9c2",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What sequence does the article recommend for your consistency action plan?",
    "question_type": "standalone",
    "options": [
      "Define minimum → set frequency goals → track showing up → prepare for low-energy days → celebrate consistency",
      "Buy expensive equipment → join elite gym → hire personal trainer → post on social media → quit after 2 weeks",
      "Start with maximum effort → ignore rest days → focus on intensity only → compare with others → burnout",
      "Wait for perfect conditions → plan extensively → never actually start → repeat cycle monthly"
    ],
    "correct_answer_index": 0,
    "explanation": "The article outlines a 5-step consistency action plan: 1) Define your minimum, 2) Set frequency over intensity goals, 3) Track showing up, 4) Prepare for low-energy days, 5) Celebrate consistency streaks rather than workout intensity.",
    "hints": [
      "Look for the numbered action plan at the end of the article",
      "Notice how each step builds on the previous one for sustainable success"
    ],
    "image_urls": []
  },
  {
    "id": "574efdcd-5de4-4983-833d-2ab63f7f7812",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "In Casey's story, what was the main problem with their fitness approach?",
    "question_type": "passage_based",
    "options": [
      "They didn't have access to a gym membership",
      "They were doing all-or-nothing workouts that left them unable to walk for days",
      "They were exercising too frequently without rest days",
      "They were following social media influencers' advice too closely"
    ],
    "correct_answer_index": 1,
    "explanation": "Casey's pattern was doing intense 2-hour Monday workouts that left them unable to walk properly until Thursday, resulting in only exercising once per week instead of building consistency.",
    "hints": [
      "Focus on Casey's described workout pattern and its consequences",
      "Consider what prevented Casey from exercising more frequently"
    ],
    "image_urls": [],
    "passage_set_id": "5c37b38c-34f0-4ddd-80c1-6b05f5f63bd3"
  },
  {
    "id": "c457d926-f448-433d-8235-ed8d8e758c7e",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What was Alex's approach that differed from Casey's?",
    "question_type": "passage_based",
    "options": [
      "Alex worked out for 2+ hours to maximize results",
      "Alex came to the gym 4 times per week but never stayed more than 30 minutes",
      "Alex focused on advanced techniques and complex programs",
      "Alex only exercised when feeling perfectly motivated"
    ],
    "correct_answer_index": 1,
    "explanation": "Alex explained that they come to the gym four times per week but never stay more than 30 minutes, demonstrating the consistency over intensity principle in action.",
    "hints": [
      "Look at what Alex says about their frequency and duration",
      "Compare Alex's sustainable approach with Casey's intensive method"
    ],
    "image_urls": [],
    "passage_set_id": "5c37b38c-34f0-4ddd-80c1-6b05f5f63bd3"
  },
  {
    "id": "e2b412d7-4ad1-4026-8fc3-f3f3dfed88f5",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What eye-opening realization did Casey have about their exercise frequency?",
    "question_type": "passage_based",
    "options": [
      "They had completed more workouts than they thought",
      "They had been to the gym six times in three months while Alex maintained consistent attendance",
      "They needed to buy more expensive equipment",
      "They were actually exercising too much"
    ],
    "correct_answer_index": 1,
    "explanation": "Casey realized they had only been to the gym six times in three months, while Alex had been consistently attending. This mathematical reality was 'embarrassing but enlightening' and showed the failure of their all-or-nothing approach.",
    "hints": [
      "Look for the specific numbers mentioned in their conversation",
      "Consider how this comparison highlighted the effectiveness of different approaches"
    ],
    "image_urls": [],
    "passage_set_id": "5c37b38c-34f0-4ddd-80c1-6b05f5f63bd3"
  },
  {
    "id": "07f5ca87-8ec4-475a-a2e4-c3201fc23e85",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "According to Alex, what concept challenged Casey's perfectionist mindset?",
    "question_type": "passage_based",
    "options": [
      "Instagram workouts are more effective than gym sessions",
      "Two 20-minute sessions you actually do beat five perfect sessions that only exist in your spreadsheet",
      "Expensive equipment guarantees better results",
      "Weekend warriors have the most successful approach"
    ],
    "correct_answer_index": 1,
    "explanation": "Alex explained that 'Two 20-minute sessions you actually do beat five perfect sessions that only exist in your spreadsheet,' highlighting how consistency in execution trumps perfection in planning.",
    "hints": [
      "Focus on Alex's key message about execution versus planning",
      "Consider how this addresses the gap between intention and action"
    ],
    "image_urls": [],
    "passage_set_id": "5c37b38c-34f0-4ddd-80c1-6b05f5f63bd3"
  },
  {
    "id": "b6ee6813-5afc-44ac-92d9-93337d58b564",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What rule helped Emma get back on track when she missed two days of exercise?",
    "question_type": "passage_based",
    "options": [
      "The 10,000 steps rule",
      "The two-day rule: never two days without movement",
      "The perfect workout rule",
      "The Instagram posting rule"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma remembered her new rule: never two days without movement. Since she'd already missed Tuesday and it was Wednesday evening, this rule made the day non-negotiable for some form of activity.",
    "hints": [
      "Look for what Emma remembered when she saw her unused workout clothes",
      "Consider how this rule prevented her from falling into a longer inactive period"
    ],
    "image_urls": [],
    "passage_set_id": "8c6ab946-50ae-4e1a-8236-90785a2a6879"
  },
  {
    "id": "092580ca-c5d2-4f6f-9fce-a72ca61cbd23",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "How did Emma's daughter contribute to her fitness consistency?",
    "question_type": "passage_based",
    "options": [
      "By criticizing her mother's exercise habits",
      "By asking with brutal honesty why she had exercise clothes but wasn't exercising",
      "By demanding they go to an expensive gym",
      "By refusing to participate in any activities"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma's six-year-old daughter asked with 'brutal honesty only children possess' why she had exercise clothes but wasn't exercising, which prompted Emma to take action rather than make excuses.",
    "hints": [
      "Consider the role of Emma's daughter in the story",
      "Think about how children's directness can sometimes provide needed accountability"
    ],
    "image_urls": [],
    "passage_set_id": "8c6ab946-50ae-4e1a-8236-90785a2a6879"
  },
  {
    "id": "7ec2c758-2fe5-46d7-8411-6504082111f3",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What alternative did Emma choose instead of her planned 45-minute workout?",
    "question_type": "passage_based",
    "options": [
      "She skipped exercise entirely until the next day",
      "She did a 15-minute dance video with her daughter",
      "She went for a solo 2-hour run",
      "She waited for perfect conditions to do her original plan"
    ],
    "correct_answer_index": 1,
    "explanation": "Instead of her planned 45-minute workout, Emma chose to do a 15-minute dance video with her daughter, demonstrating that something is infinitely better than nothing when building consistency.",
    "hints": [
      "Look for what Emma actually ended up doing that evening",
      "Consider how this choice exemplified the article's main principle"
    ],
    "image_urls": [],
    "passage_set_id": "8c6ab946-50ae-4e1a-8236-90785a2a6879"
  },
  {
    "id": "31eba814-ba0f-4fe7-877d-9436bbeb9aad",
    "created_at": "2024-01-31T00:00:00Z",
    "updated_at": "2024-01-31T00:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d486",
    "question_text": "What made the modified workout meaningful beyond just maintaining consistency?",
    "question_type": "passage_based",
    "options": [
      "It burned exactly the same calories as her planned workout",
      "Her daughter's giggles during the workout made it the highlight of her week",
      "She achieved perfect form in all movements",
      "It impressed her social media followers"
    ],
    "correct_answer_index": 1,
    "explanation": "The modified workout became meaningful because her daughter's giggles during the dance video made it 'the highlight of her week,' showing that consistency can create unexpected joy and connection beyond just fitness benefits.",
    "hints": [
      "Consider the emotional and social benefits that emerged from this choice",
      "Think about how this moment went beyond just 'exercise' to create family bonding"
    ],
    "image_urls": [],
    "passage_set_id": "8c6ab946-50ae-4e1a-8236-90785a2a6879"
  },
  {
    "id": "60560d71-7e38-4113-b0d5-0fb826c87fb3",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "Chronic stress directly sabotages fitness efforts by breaking down muscle tissue for energy.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "Elevated cortisol from chronic stress does break down muscle tissue for energy, while also promoting fat storage, disrupting sleep quality, and reducing recovery capacity between workouts.",
    "hints": [
      "Think about what happens to cortisol levels when you're chronically stressed",
      "Consider how stress hormones affect muscle protein synthesis"
    ],
    "image_urls": []
  },
  {
    "id": "aa26f9f0-4b0a-4731-8209-bef58f37dfee",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "People with workout partners are 2x more likely to stick with exercise programs.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "The social multiplier effect shows that people with workout partners are indeed 2x more likely to stick with exercise, while friends who support your goals increase success rates by 40%.",
    "hints": [
      "Consider the accountability factor when exercising with others",
      "Think about how social support impacts motivation and consistency"
    ],
    "image_urls": []
  },
  {
    "id": "78e96e86-73af-480a-aba9-71ab675c382d",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "Most people who claim they don't have time for fitness actually spend 4-5 hours daily on social media.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "While the article mentions people spend 2-3 hours daily on social media, it states that 4-5 hours is above average, not typical for most people.",
    "hints": [
      "Look at the specific numbers mentioned about average screen time",
      "Consider what constitutes typical versus above-average usage"
    ],
    "image_urls": []
  },
  {
    "id": "f3818a61-8eb7-43e1-9e49-c4f30f4465d9",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "Alcohol reduces protein synthesis by up to 40%, hindering muscle growth.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "Alcohol significantly impacts protein synthesis, reducing it by up to 40%, which directly affects muscle growth and recovery. It also disrupts REM sleep and adds empty calories.",
    "hints": [
      "Think about how alcohol affects the body's ability to build and repair muscle",
      "Consider the recovery implications of alcohol consumption"
    ],
    "image_urls": []
  },
  {
    "id": "3809f4be-5e34-4002-ac02-acf05ceac5e1",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "When trying to reduce stress for better fitness results, which technique involves breathing patterns?",
    "question_type": "standalone",
    "options": [
      "The 5-5-5 breathing technique",
      "The 10-8-6 power breathing method",
      "The 3-2-1 exhale protocol",
      "The hyperventilation happiness hack"
    ],
    "correct_answer_index": 0,
    "explanation": "The 5-5-5 breathing technique (inhale for 5 counts, hold for 5, exhale for 5, done 3 times when stressed) is specifically mentioned as a practical stress-buster that actually works.",
    "hints": [
      "Look for the breathing technique specifically mentioned in the stress management section",
      "The correct technique uses equal counts for each phase"
    ],
    "image_urls": []
  },
  {
    "id": "e6cc8135-778b-42c7-a0ef-03b2507def26",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What should you do if your social environment doesn't support your fitness goals?",
    "question_type": "standalone",
    "options": [
      "Completely isolate yourself from unsupportive people",
      "Use 'I'm prioritizing my health' as a boundary and find your fitness tribe",
      "Give up on fitness to maintain social harmony",
      "Start a fitness cult and recruit everyone you know"
    ],
    "correct_answer_index": 1,
    "explanation": "The article suggests setting boundaries by saying 'I'm prioritizing my health' (which is a complete sentence) and finding your tribe through group classes, running clubs, or online communities.",
    "hints": [
      "Think about healthy boundary setting mentioned in the social environment section",
      "Consider the balance between maintaining relationships and pursuing health goals"
    ],
    "image_urls": []
  },
  {
    "id": "8c42236f-348d-409a-bbbf-8b9becc918e2",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "According to the article, what's the recommended approach for managing alcohol consumption while pursuing fitness goals?",
    "question_type": "standalone",
    "options": [
      "Complete abstinence is the only option",
      "The 2-drink rule with proper hydration and timing",
      "Alcohol doesn't affect fitness at all",
      "Switch to energy drinks for better results"
    ],
    "correct_answer_index": 1,
    "explanation": "The moderation approach suggests limiting to 2 drinks when you indulge, matching each alcoholic drink with water, and avoiding alcohol within 48 hours of strength training.",
    "hints": [
      "Look for the specific moderation strategies mentioned",
      "Consider the practical guidelines rather than extreme positions"
    ],
    "image_urls": []
  },
  {
    "id": "889913c7-88d6-4aed-a604-87271981c2f4",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What does the article suggest about workplace wellness integration?",
    "question_type": "standalone",
    "options": [
      "Your job is always an excuse to avoid fitness",
      "Quit your job to focus on fitness full-time",
      "Integrate movement into your workday with walking meetings and desk exercises",
      "Only exercise after work hours to maintain professionalism"
    ],
    "correct_answer_index": 2,
    "explanation": "The article emphasizes that your job shouldn't be an excuse but should be integrated with fitness goals through walking meetings, standing during calls, taking stairs, and doing desk exercises.",
    "hints": [
      "Think about the workplace wellness hacks mentioned in the article",
      "Consider how to make fitness part of your work routine, not separate from it"
    ],
    "image_urls": []
  },
  {
    "id": "9eb77387-e7ec-41a6-be41-a7b11012f5f7",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What is the correct order of steps in the 1% Better Philosophy for lifestyle changes?",
    "question_type": "standalone",
    "options": [
      "Week 1-2: Pick one factor → Week 3-4: Add second change → Month 2: Add third → Month 3: All are habits",
      "Month 1: Change everything → Month 2: Maintain → Month 3: Add more",
      "Week 1: All changes at once → Week 2: Maintain → Week 3: Give up",
      "Day 1: Perfect lifestyle → Day 2: Burn out → Day 3: Start over"
    ],
    "correct_answer_index": 0,
    "explanation": "The 1% Better Philosophy specifically outlines picking ONE lifestyle factor to improve by 10% in weeks 1-2, maintaining while adding another in weeks 3-4, stacking a third change in month 2, and by month 3 these become habits.",
    "hints": [
      "Look for the specific timeline mentioned in the 1% Better Philosophy section",
      "Consider the gradual progression rather than dramatic changes"
    ],
    "image_urls": []
  },
  {
    "id": "718c972f-d70e-4395-9ba9-6cb9462521ae",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "According to the fitness success formula provided, which statement is correct?",
    "question_type": "standalone",
    "options": [
      "Lifestyle factors add together to create fitness success",
      "Exercise alone is sufficient for fitness success",
      "Lifestyle factors multiply rather than add, so when one falls apart it can zero out efforts",
      "Only nutrition matters for lifestyle factors"
    ],
    "correct_answer_index": 2,
    "explanation": "The article states that lifestyle factors multiply, not add, in the success formula. When one factor falls apart, it can zero out your efforts, but when they align, that's when magic happens.",
    "hints": [
      "Look at the specific mathematical relationship described in the success formula",
      "Consider why one failing factor could impact everything else"
    ],
    "image_urls": []
  },
  {
    "id": "ca4e9cc6-fa32-4568-8761-c6109ea6ba58",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "Which combination of factors creates the positive spiral effect mentioned in the article?",
    "question_type": "standalone",
    "options": [
      "Better sleep → More energy → Better stress management → Better food choices → Improved sleep",
      "More exercise → More fatigue → More stress → Emotional eating → Worse sleep",
      "Social media → Less time → Skipped workouts → Higher stress → Poor choices",
      "Perfect diet → Instant results → Overconfidence → Burnout → Giving up"
    ],
    "correct_answer_index": 0,
    "explanation": "The positive spiral involves better sleep leading to more energy for workouts, regular exercise improving stress management, less stress leading to better food choices, and better nutrition improving sleep quality in a continuous beneficial cycle.",
    "hints": [
      "Look for the compound effect explanation with the positive spiral",
      "Consider how each factor supports the next in a beneficial cycle"
    ],
    "image_urls": []
  },
  {
    "id": "704effe6-1592-4249-a4fc-7da7f53f3616",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "In Emma's time management story, what was her initial objection to meal prep?",
    "question_type": "passage_based",
    "options": [
      "She didn't like cooking",
      "She was too busy with kids and work",
      "She didn't have a kitchen",
      "She preferred restaurant food"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma protested that she was 'too busy with the kids and work' when Marcus suggested meal prep, before he showed her the screen time data revealing she had plenty of time that was being used differently.",
    "hints": [
      "Think about the common excuse Emma gave for not having time",
      "Consider what she said about her competing priorities"
    ],
    "image_urls": [],
    "passage_set_id": "ea90f83a-02fa-466c-899a-446b51bd5adc"
  },
  {
    "id": "2428a4f0-4e2a-4a38-b09f-424d4370d760",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What was Emma's screen time according to her phone report?",
    "question_type": "passage_based",
    "options": [
      "Two hours and fifteen minutes",
      "Three hours and forty-seven minutes",
      "Five hours and thirty minutes",
      "One hour and twenty minutes"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma's phone showed 'Three hours and forty-seven minutes? Yesterday?' when she checked her screen time report, which Marcus noted was actually below the 4-5 hour average.",
    "hints": [
      "Look for the exact time Emma read from her phone",
      "Remember this was considered below average according to Marcus"
    ],
    "image_urls": [],
    "passage_set_id": "ea90f83a-02fa-466c-899a-446b51bd5adc"
  },
  {
    "id": "1bcfbde1-946e-42e0-b716-e4e888600d12",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What insight did Marcus provide about scrolling versus walking?",
    "question_type": "passage_based",
    "options": [
      "Both activities burn the same calories",
      "Scrolling is more mentally stimulating",
      "Scrolling increases cortisol while walking decreases it - opposite results for same time investment",
      "Walking is only good for physical health"
    ],
    "correct_answer_index": 2,
    "explanation": "Marcus explained that people think scrolling is relaxing, but it actually increases cortisol, while walking decreases it, providing 'same time investment, opposite results.'",
    "hints": [
      "Consider what Marcus said about the stress hormone effects",
      "Think about the comparison he made between the two activities"
    ],
    "image_urls": [],
    "passage_set_id": "ea90f83a-02fa-466c-899a-446b51bd5adc"
  },
  {
    "id": "364f967a-e09f-4c3d-91d1-ac0212a76e57",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "How many hours per week did Emma potentially find for fitness without adding time to her day?",
    "question_type": "passage_based",
    "options": [
      "3 hours",
      "5 hours",
      "7 hours",
      "10 hours"
    ],
    "correct_answer_index": 2,
    "explanation": "Marcus concluded that Emma 'just found 7 hours for fitness without adding a single minute to your day' by suggesting batch cooking on Sundays, walking during lunch breaks, and limiting scrolling to treadmill time.",
    "hints": [
      "Look for the specific number Marcus calculated at the end",
      "Consider all the time-saving strategies he mentioned combined"
    ],
    "image_urls": [],
    "passage_set_id": "ea90f83a-02fa-466c-899a-446b51bd5adc"
  },
  {
    "id": "26aa5327-b247-450d-9f67-e1b7c5708796",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What was concerning about Taylor's cortisol levels according to Dr. Chen?",
    "question_type": "passage_based",
    "options": [
      "They were too low and causing fatigue",
      "They were normal and healthy",
      "They were so elevated they were canceling out his workouts",
      "They were fluctuating too much throughout the day"
    ],
    "correct_answer_index": 2,
    "explanation": "Dr. Chen explained that Taylor's stress hormones were 'so elevated they're canceling out your workouts' and that his body was in survival mode, hoarding fat because it thought there was an emergency.",
    "hints": [
      "Think about what Dr. Chen said about the impact on Taylor's exercise efforts",
      "Consider the survival mode explanation"
    ],
    "image_urls": [],
    "passage_set_id": "9425fdff-2248-4ff2-955b-4407b0c25ae4"
  },
  {
    "id": "92c3729f-7e6e-4401-896f-c876b53a28cc",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What analogy did Dr. Chen use to explain Taylor's situation?",
    "question_type": "passage_based",
    "options": [
      "Like running a marathon with ankle weights",
      "Like driving a car with the parking brake on",
      "Like swimming upstream against a current",
      "Like trying to fill a bucket with holes in it"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Chen said 'You're driving a car with the parking brake on. We need to release the brake—lower your cortisol—before pushing the accelerator. Otherwise, you'll just burn out the engine.'",
    "hints": [
      "Think about the mechanical metaphor Dr. Chen used",
      "Consider what needs to be released before acceleration"
    ],
    "image_urls": [],
    "passage_set_id": "9425fdff-2248-4ff2-955b-4407b0c25ae4"
  },
  {
    "id": "131328a6-5789-4a73-a050-d908b6175a6d",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What modifications did Dr. Chen recommend for Taylor's exercise routine?",
    "question_type": "passage_based",
    "options": [
      "Increase intensity and frequency",
      "Replace two intense sessions with yoga or walking and add meditation",
      "Stop exercising completely until stress reduces",
      "Switch to only weight training"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Chen recommended replacing 'two intense sessions with yoga or walking' and adding 'ten minutes of meditation' while ensuring Taylor got 'seven hours of sleep minimum. Non-negotiable.'",
    "hints": [
      "Consider what Dr. Chen suggested to lower the stress load",
      "Think about the balance between reducing intensity and maintaining activity"
    ],
    "image_urls": [],
    "passage_set_id": "9425fdff-2248-4ff2-955b-4407b0c25ae4"
  },
  {
    "id": "7f8e9a2b-4c5d-6e7f-8901-234567890abc",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What was Taylor's average sleep duration according to Dr. Chen's review?",
    "question_type": "passage_based",
    "options": [
      "Six to seven hours per night",
      "Four to five hours average",
      "Three to four hours on weekdays",
      "Seven to eight hours but poor quality"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Chen looked at the sleep data and noted 'Four to five hours average?' which was clearly insufficient for Taylor's recovery needs, leading to the doctor's recommendation for 'seven hours of sleep minimum. Non-negotiable.'",
    "hints": [
      "Look at what Dr. Chen observed when reviewing Taylor's sleep data",
      "Consider why Dr. Chen was concerned about this specific aspect"
    ],
    "image_urls": [],
    "passage_set_id": "9425fdff-2248-4ff2-955b-4407b0c25ae4"
  },
  {
    "id": "66611c26-97b1-4f6e-b5d9-bf3f8f98bf66",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 20,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What metaphor did Jordan use to describe building social support?",
    "question_type": "passage_based",
    "options": [
      "Swimming upstream alone versus building a boat with others",
      "Climbing a mountain solo versus with a team",
      "Fighting a battle alone versus with an army",
      "Running a race solo versus in a relay"
    ],
    "correct_answer_index": 0,
    "explanation": "Jordan said 'So instead of swimming upstream alone...' and Casey finished 'Build a boat with others,' capturing Jordan's philosophy of collaborative rather than isolated fitness efforts.",
    "hints": [
      "Look for the water-related metaphor in the conversation",
      "Think about the contrast between struggling alone versus working together"
    ],
    "image_urls": [],
    "passage_set_id": "d93b9ccc-92aa-42ba-84ed-03731fe6359e"
  },
  {
    "id": "3ecb3395-6194-49b4-9026-1b9db7293543",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 21,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "According to Jordan's experience, what's the best way to find support for fitness goals?",
    "question_type": "passage_based",
    "options": [
      "Wait for others to invite you to join their programs",
      "Offer support first to find others who want to be healthier",
      "Only work with professional trainers",
      "Avoid involving friends and family in fitness goals"
    ],
    "correct_answer_index": 1,
    "explanation": "Jordan concluded by saying 'The best way to find support is to offer it first,' suggesting that taking initiative to help others creates the collaborative environment needed for mutual success.",
    "hints": [
      "Think about Jordan's final advice to Casey",
      "Consider the principle of giving to receive in social dynamics"
    ],
    "image_urls": [],
    "passage_set_id": "d93b9ccc-92aa-42ba-84ed-03731fe6359e"
  },
  {
    "id": "b80aa212-dfa5-467c-9822-fa4a9912cf13",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 22,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What final action was Casey considering by the end of the conversation?",
    "question_type": "passage_based",
    "options": [
      "Quitting the gym permanently",
      "Starting a beginners' workout group",
      "Moving to a new city for better support",
      "Hiring a personal trainer"
    ],
    "correct_answer_index": 1,
    "explanation": "Casey said 'Maybe I could start a beginners' workout group' after Jordan's advice about offering support first to build collaborative fitness relationships.",
    "hints": [
      "Look at Casey's response to Jordan's advice about offering support",
      "Think about how Casey planned to apply the collaborative approach"
    ],
    "image_urls": [],
    "passage_set_id": "d93b9ccc-92aa-42ba-84ed-03731fe6359e"
  },
  {
    "id": "1406c549-5abf-4649-a04c-abfd9983c751",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 23,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d487",
    "question_text": "What was Casey's initial reason for wanting to quit the gym?",
    "question_type": "passage_based",
    "options": [
      "The equipment was too complicated",
      "Everyone there was already fit and Casey felt like a fraud",
      "The membership was too expensive",
      "The gym was too crowded during peak hours"
    ],
    "correct_answer_index": 1,
    "explanation": "Casey announced 'I'm done with the gym. Everyone there is already fit. I feel like a fraud.' This reveals the intimidation and imposter syndrome that many beginners experience in fitness environments.",
    "hints": [
      "Think about Casey's opening statement about feeling out of place",
      "Consider the emotional reason rather than practical obstacles"
    ],
    "image_urls": [],
    "passage_set_id": "d93b9ccc-92aa-42ba-84ed-03731fe6359e"
  },
  {
    "id": "3d3314bf-00b3-4461-a014-31b1fb076560",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "The principle of progressive overload works the same way whether you're 18 or 80.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "Progressive overload - gradually increasing challenge to muscles - is a universal principle that works at any age. The weight or intensity might differ, but the principle remains the same.",
    "hints": [
      "Think about what makes muscles stronger at any age",
      "Consider the universal principles mentioned in the article"
    ],
    "image_urls": []
  },
  {
    "id": "f5f07000-fbc6-42ae-b56b-12a77ace08eb",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "Recovery time needed after intense exercise stays the same throughout your life.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "Recovery time increases with age: 20s need 24-48 hours, 40s need 48-72 hours, and 60s+ typically need 72-96 hours for full recovery from intense sessions.",
    "hints": [
      "Look at the recovery time reality check in the article",
      "Think about how your body changes as you age"
    ],
    "image_urls": []
  },
  {
    "id": "056d956e-ac17-4e8d-bf99-6158b3fcdb08",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "People in their 90s can still build muscle with proper training.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "Research shows that people in their 90s can still build muscle, bone density can improve at any age with weight-bearing exercise, and balance can be retrained regardless of age.",
    "hints": [
      "Check the 'Never-Too-Late Principle' section",
      "Consider what the research shows about muscle building"
    ],
    "image_urls": []
  },
  {
    "id": "e89cce4d-606a-4653-9325-d6bd5be6903f",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "Testosterone declines by approximately 10% per year after age 30.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "Testosterone declines by approximately 1% per year after age 30, not 10%. This gradual decline is why strength training becomes important to help maintain hormone levels.",
    "hints": [
      "Look at the hormonal factor section carefully",
      "Think about a realistic rate of hormonal decline"
    ],
    "image_urls": []
  },
  {
    "id": "40b6feda-c430-427f-9271-f33af2c3d4b9",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "What's the main reason people in their 20s-30s should focus on building muscle mass?",
    "question_type": "standalone",
    "options": [
      "To win bodybuilding competitions",
      "To build a 'muscle bank account' for later life",
      "To impress people at the gym",
      "To become professional athletes"
    ],
    "correct_answer_index": 1,
    "explanation": "The article emphasizes building muscle in your 20s-30s is like compound interest - it creates a foundation you can afford to lose some of while still maintaining function in later years.",
    "hints": [
      "Think about the compound interest analogy",
      "Consider long-term benefits rather than short-term goals"
    ],
    "image_urls": []
  },
  {
    "id": "bf88fd21-e061-4244-9716-d72473e09007",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "For someone in their 60s and beyond, what should be the primary exercise focus?",
    "question_type": "standalone",
    "options": [
      "Maximum strength and power development",
      "Functional fitness for daily activities",
      "Competitive sports performance",
      "Extreme endurance challenges"
    ],
    "correct_answer_index": 1,
    "explanation": "The article clearly states that for 60s+, the focus should be on functional fitness for daily activities, fall prevention through balance work, maintaining muscle mass, and low-impact cardio options.",
    "hints": [
      "Look at what the 60s+ section emphasizes",
      "Think about practical daily needs rather than performance goals"
    ],
    "image_urls": []
  },
  {
    "id": "5fde7c40-25b6-4f67-ad25-d56a374178e1",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "What mistake do people in their 40s-50s commonly make with exercise?",
    "question_type": "standalone",
    "options": [
      "Doing too much low-impact exercise",
      "Focusing too much on flexibility",
      "Trying to exercise like they're still 25",
      "Spending too much time on balance training"
    ],
    "correct_answer_index": 2,
    "explanation": "The article specifically mentions that a common mistake for people in their 40s-50s is trying to exercise like they're still 25, along with giving up when progress slows.",
    "hints": [
      "Check the common mistakes listed for the 40s-50s age group",
      "Think about ego versus reality"
    ],
    "image_urls": []
  },
  {
    "id": "bf3f3384-ef44-4085-8b42-90bb677ead28",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "Why does exercise become more important as we age rather than less important?",
    "question_type": "standalone",
    "options": [
      "Because older people have more free time",
      "Because it's easier to exercise when you're older",
      "Because age brings natural decline that exercise can combat",
      "Because gyms offer senior discounts"
    ],
    "correct_answer_index": 2,
    "explanation": "Exercise becomes more crucial with age because it combats natural declines like muscle loss (sarcopenia), bone density reduction, balance issues, and cardiovascular efficiency decline.",
    "hints": [
      "Think about what naturally happens as we age",
      "Consider why the article emphasizes exercise as we get older"
    ],
    "image_urls": []
  },
  {
    "id": "7d7ded34-1216-47d6-a666-2ba18f46b6ca",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "Which sequence shows the correct weekly exercise framework progression from youngest to oldest?",
    "question_type": "standalone",
    "options": [
      "More rest days → Fewer rest days → Most rest days",
      "3 strength sessions → 2 strength sessions → 2 strength sessions",
      "No flexibility work → Some flexibility → Lots of flexibility",
      "All of the above changes happen together"
    ],
    "correct_answer_index": 3,
    "explanation": "All these changes occur together as we age: rest days increase (1→2→2), strength sessions decrease (3-4→2-3→2), and flexibility work increases (1→2→2 sessions).",
    "hints": [
      "Look at the weekly framework by age section",
      "Notice how multiple factors change simultaneously"
    ],
    "image_urls": []
  },
  {
    "id": "f7abfc66-8c4a-4a94-8a1e-b973465c3d66",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "What combination of factors makes exercise adaptation slower in older adults?",
    "question_type": "standalone",
    "options": [
      "Longer recovery time + hormonal changes + increased injury risk",
      "Less motivation + poor weather + expensive gym memberships",
      "Bad genetics + lack of equipment + scheduling conflicts",
      "Too much social media + poor diet + inadequate sleep"
    ],
    "correct_answer_index": 0,
    "explanation": "The article identifies that longer recovery times, hormonal changes (decreased testosterone, growth hormone), and increased injury risk all contribute to slower adaptation in older adults.",
    "hints": [
      "Look for the physiological changes mentioned in the article",
      "Focus on biological rather than external factors"
    ],
    "image_urls": []
  },
  {
    "id": "c0ea9c31-807d-495d-82cf-9259bd634ee1",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "Based on the article, which modification sequence correctly shows exercise adaptations with age?",
    "question_type": "standalone",
    "options": [
      "High-impact → Low-impact → No-impact → Chair-based",
      "Heavy weights → Lighter weights → Resistance bands → Bodyweight only",
      "Competition focus → Performance focus → Health focus → Functional focus",
      "Running → Elliptical → Walking → Water aerobics"
    ],
    "correct_answer_index": 2,
    "explanation": "The article describes how exercise motivation and focus evolves: 20s-30s focus on appearance/performance, 40s-50s on health/stress relief, 60s+ on independence and cognitive health.",
    "hints": [
      "Look at 'The Mental Game Changes Too' section",
      "Think about shifting priorities rather than just physical modifications"
    ],
    "image_urls": []
  },
  {
    "id": "a0cc1bfa-df09-4f49-a281-7e99704fe2ec",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "What was Taylor's main concern about starting an exercise program at 45?",
    "question_type": "passage_based",
    "options": [
      "Worried about blood pressure during exercise",
      "Concerned about joint pain and arthritis",
      "Afraid of looking foolish at the gym",
      "Uncertain about proper exercise form"
    ],
    "correct_answer_index": 0,
    "explanation": "In the passage, Taylor specifically states: 'I want to get healthy, but I'm worried about my blood pressure during exercise' when speaking with Dr. Martinez.",
    "hints": [
      "Look at Taylor's direct quote to the doctor",
      "Focus on the health condition mentioned"
    ],
    "image_urls": [],
    "passage_set_id": "8485e354-5803-4211-8c05-405a1b3afcf2"
  },
  {
    "id": "fa4da7d7-d07e-46bb-8b02-d8ca06123587",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "How did Dr. Martinez reassure Taylor about exercise and blood pressure?",
    "question_type": "passage_based",
    "options": [
      "Exercise temporarily raises blood pressure but lowers it long-term",
      "Blood pressure medications will prevent any exercise risks",
      "Taylor should wait until blood pressure improves before exercising",
      "Only gentle stretching is safe for people with high blood pressure"
    ],
    "correct_answer_index": 0,
    "explanation": "Dr. Martinez explained that while weight training 'temporarily, yes' raises blood pressure, 'long-term it actually helps lower it' when done correctly with proper breathing.",
    "hints": [
      "Look at the doctor's explanation about temporary vs. long-term effects",
      "Focus on what Dr. Martinez said about blood pressure and exercise"
    ],
    "image_urls": [],
    "passage_set_id": "8485e354-5803-4211-8c05-405a1b3afcf2"
  },
  {
    "id": "8cd3b4b7-5ce2-4120-a881-a85cf4cf029b",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "What initial exercise approach did Dr. Martinez recommend for Taylor?",
    "question_type": "passage_based",
    "options": [
      "High-intensity interval training to maximize results",
      "10-minute walks after meals and lighter weight training",
      "Only swimming and water-based exercises",
      "Wait for perfect health markers before starting any exercise"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Martinez specifically recommended 'Start with 10-minute walks after meals - that alone can help with blood sugar' and mentioned lighter weights with higher repetitions.",
    "hints": [
      "Look for the specific recommendations the doctor made",
      "Focus on the gentle starting approach mentioned"
    ],
    "image_urls": [],
    "passage_set_id": "8485e354-5803-4211-8c05-405a1b3afcf2"
  },
  {
    "id": "9f95e3fa-c232-43dd-b696-59266da60e2d",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "How did Taylor feel after the doctor's appointment?",
    "question_type": "passage_based",
    "options": [
      "Disappointed and restricted by too many limitations",
      "Empowered rather than restricted about starting exercise",
      "Confused about conflicting medical advice",
      "Skeptical about whether exercise would really help"
    ],
    "correct_answer_index": 1,
    "explanation": "The passage ends with: 'Leaving the office, Taylor felt empowered rather than restricted. The journey would be different from a healthy 25-year-old's, but it was still very much possible.'",
    "hints": [
      "Look at the final sentence describing Taylor's emotional state",
      "Focus on the contrast between feeling restricted vs. empowered"
    ],
    "image_urls": [],
    "passage_set_id": "8485e354-5803-4211-8c05-405a1b3afcf2"
  },
  {
    "id": "130dbdd1-58b0-45e5-a79f-96faebaacc0e",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "What was Mike's initial reaction to his reduced lifting capacity?",
    "question_type": "passage_based",
    "options": [
      "Accepting and realistic about his current fitness level",
      "Frustrated that he could only lift his former warm-up weight",
      "Excited to start building strength again from scratch",
      "Indifferent to the weight he was lifting"
    ],
    "correct_answer_index": 1,
    "explanation": "Mike 'stared at the barbell, loaded with what used to be his warm-up weight' and said 'I used to bench twice this,' showing his frustration with his reduced capacity after a decade away from the gym.",
    "hints": [
      "Look at Mike's body language and what he said about the weight",
      "Focus on his comparison to his former abilities"
    ],
    "image_urls": [],
    "passage_set_id": "27f3c0c8-f444-4366-8ab2-47683dedaa6b"
  },
  {
    "id": "9ad47e29-5c78-4306-9751-ddf018ce8557",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "What key insight did James share about training in his 40s?",
    "question_type": "passage_based",
    "options": [
      "Older people should avoid heavy weights completely",
      "Age is the enemy of fitness progress",
      "Ego is the real enemy, not age itself",
      "It's impossible to get stronger after 40"
    ],
    "correct_answer_index": 2,
    "explanation": "James specifically told Mike: 'Our age isn't the enemy - our ego is' and explained how focusing on consistency over weight made him stronger at 42 than at 32.",
    "hints": [
      "Look for James's direct quote about what the real enemy is",
      "Focus on his philosophy about age vs. attitude"
    ],
    "image_urls": [],
    "passage_set_id": "27f3c0c8-f444-4366-8ab2-47683dedaa6b"
  },
  {
    "id": "66f75aec-5752-4dca-93d3-ed55d34033ca",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "What advantage did James say older exercisers have over younger ones?",
    "question_type": "passage_based",
    "options": [
      "Better flexibility and mobility",
      "More time to dedicate to exercise",
      "They recover slower but are smarter",
      "Superior cardiovascular endurance"
    ],
    "correct_answer_index": 2,
    "explanation": "James told Mike: 'we recover slower but we're smarter. Use that advantage,' highlighting how wisdom and experience can compensate for slower physical recovery.",
    "hints": [
      "Look for what James said about the trade-off between recovery and wisdom",
      "Focus on the compensating advantage mentioned"
    ],
    "image_urls": [],
    "passage_set_id": "27f3c0c8-f444-4366-8ab2-47683dedaa6b"
  },
  {
    "id": "8901bc3c-9902-4e3f-a6ce-c68b46aea65e",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d488",
    "question_text": "How did Mike's perspective change by the end of the conversation?",
    "question_type": "passage_based",
    "options": [
      "He decided to quit exercising until he felt stronger",
      "He realized starting over at 35 meant starting with wisdom, not from zero",
      "He became more frustrated with his current limitations",
      "He decided to hire a personal trainer immediately"
    ],
    "correct_answer_index": 1,
    "explanation": "The passage ends with: 'Mike racked the weight, humbled but motivated. Starting over at 35 wasn't starting from zero - it was starting with wisdom.'",
    "hints": [
      "Look at the final sentence about Mike's realization",
      "Focus on the distinction between 'zero' and 'wisdom'"
    ],
    "image_urls": [],
    "passage_set_id": "27f3c0c8-f444-4366-8ab2-47683dedaa6b"
  },
  {
    "id": "2c24c858-11f2-4d8b-831d-246f87a34116",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "Regular exercise can reduce the risk of Type 2 diabetes by 58% with just 150 minutes of moderate activity per week.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "This statistic is directly from the article - studies following millions of people show that 150 minutes of moderate exercise weekly reduces Type 2 diabetes risk by 58%.",
    "hints": [
      "Think about the specific percentage mentioned in the article's opening statistics",
      "Consider what constitutes the minimum recommended weekly exercise amount"
    ],
    "image_urls": []
  },
  {
    "id": "5035ae38-271e-4eb3-a0f7-d44976d6ce03",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "Exercise reduces inflammation markers like C-reactive protein by 30-40%.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "The article specifically states that exercise reduces inflammation markers, with C-reactive protein dropping by 30-40%. Chronic inflammation is linked to many diseases, so this reduction is significant for disease prevention.",
    "hints": [
      "Look for information about how exercise affects inflammation in the cardiovascular section",
      "C-reactive protein is a key inflammation marker mentioned in the article"
    ],
    "image_urls": []
  },
  {
    "id": "0f503534-49d5-40f0-85e8-278bdd15e799",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "The minimum effective dose for disease prevention requires at least 300 minutes of exercise per week.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The article states the 'magic number' is 150 minutes of moderate activity OR 75 minutes of vigorous activity weekly. Even less than that helps - just 15 minutes daily provides significant benefits.",
    "hints": [
      "Check the minimum effective dose section for the actual recommended weekly minutes",
      "Remember the article emphasizes that even small amounts of exercise provide benefits"
    ],
    "image_urls": []
  },
  {
    "id": "d5f8870c-a828-4417-a9b1-43fb831bbb93",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "Exercise increases natural killer cells by up to 50%, which helps fight cancer.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "True. The article explains that exercise fights cancer through multiple pathways, including an immune boost where natural killer cells increase by up to 50% after exercise.",
    "hints": [
      "Look in the cancer defense system section for information about immune system benefits",
      "Natural killer cells are part of your immune system's cancer-fighting arsenal"
    ],
    "image_urls": []
  },
  {
    "id": "430e7304-3049-493a-8695-eb4fbc417775",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "Which of the following diseases shows the highest risk reduction percentage from regular exercise?",
    "question_type": "standalone",
    "options": [
      "Type 2 Diabetes (58% reduction)",
      "Heart Disease (35% reduction)",
      "Stroke (27% reduction)",
      "Becoming a couch potato (100% reduction because you're actively not being one)"
    ],
    "correct_answer_index": 0,
    "explanation": "Type 2 diabetes shows the highest risk reduction at 58% with regular exercise, followed by heart disease at 35%, then stroke at 27%. The prevention statistics are powerful motivators for starting an exercise routine.",
    "hints": [
      "Review the opening statistics about disease risk reduction",
      "Compare the percentages for different major diseases mentioned"
    ],
    "image_urls": []
  },
  {
    "id": "bb6aee73-f95b-44f5-99bf-9e6df0882b71",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "How does exercise help prevent diabetes at the cellular level?",
    "question_type": "standalone",
    "options": [
      "By making muscles more sensitive to insulin",
      "By producing more insulin in the pancreas",
      "By eliminating sugar from the diet completely",
      "By turning your muscles into tiny sugar-eating monsters (nom nom nom)"
    ],
    "correct_answer_index": 0,
    "explanation": "Exercise makes muscles more sensitive to insulin, meaning your body needs less insulin to manage blood sugar. This prevents insulin resistance, which is the pathway to Type 2 diabetes.",
    "hints": [
      "Think about the 'blood sugar shield' mechanism described in the article",
      "Consider how exercise affects insulin sensitivity rather than insulin production"
    ],
    "image_urls": []
  },
  {
    "id": "d55e03df-2176-4e85-ba5b-5bd925c2bc41",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What happens to your blood pressure after exercise?",
    "question_type": "standalone",
    "options": [
      "It stays elevated for several hours",
      "It drops for up to 22 hours post-exercise",
      "It returns to normal within 10 minutes",
      "It transforms into magical fairy dust and floats away"
    ],
    "correct_answer_index": 1,
    "explanation": "The article states that blood pressure drops for up to 22 hours post-exercise. This extended benefit is one of the ways exercise acts as cardiovascular medicine.",
    "hints": [
      "Check the cardiovascular cleanup crew section",
      "Think about the lasting effects of exercise beyond just the workout period"
    ],
    "image_urls": []
  },
  {
    "id": "7f8977a9-3dc1-4d52-8d58-a55c915dd9b5",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "According to the article, exercise is as effective as which treatment for mild to moderate depression?",
    "question_type": "standalone",
    "options": [
      "Antidepressant medications",
      "Therapy sessions",
      "Meditation practices",
      "Watching cat videos (though that's pretty effective too)"
    ],
    "correct_answer_index": 0,
    "explanation": "The article specifically states that exercise is as effective as antidepressants for mild to moderate depression. This demonstrates exercise's powerful impact on mental health disease prevention.",
    "hints": [
      "Look for information about mental health conditions in the diseases section",
      "Consider what medical treatment is mentioned as being equally effective"
    ],
    "image_urls": []
  },
  {
    "id": "5d9248f5-5b79-4c18-b25a-98de016b481d",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What is the correct sequence of cardiovascular benefits that occur after exercise?",
    "question_type": "standalone",
    "options": [
      "Blood pressure drops → HDL increases → Inflammation reduces → Blood vessels become more flexible",
      "HDL increases → Blood pressure drops → Blood vessels become more flexible → Inflammation reduces",
      "Inflammation reduces → Blood vessels become more flexible → Blood pressure drops → HDL increases",
      "All benefits happen simultaneously in a beautiful cardiovascular symphony"
    ],
    "correct_answer_index": 3,
    "explanation": "While the article lists these benefits separately, they actually occur simultaneously as part of the cardiovascular cleanup crew response to exercise. All these mechanisms work together to protect heart health.",
    "hints": [
      "Think about how the cardiovascular system responds as an integrated whole",
      "Consider that multiple protective mechanisms can work at the same time"
    ],
    "image_urls": []
  },
  {
    "id": "b162d488-a86f-4b06-b05a-cedac762c751",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "Which combination of factors makes exercise most effective for cancer prevention?",
    "question_type": "standalone",
    "options": [
      "Immune boost + Hormone regulation + Inflammation reduction + Improved digestion",
      "Weight loss + Muscle building + Cardio fitness + Flexibility",
      "High intensity + Long duration + Daily frequency + Strict diet",
      "Determination + Good playlist + Matching workout outfit + Post-workout selfie"
    ],
    "correct_answer_index": 0,
    "explanation": "The article explains that exercise fights cancer through multiple pathways: immune boost (50% increase in natural killer cells), hormone regulation (reducing excess estrogen and growth factors), inflammation reduction, and improved digestion (faster transit time).",
    "hints": [
      "Review the cancer defense system section for the multiple pathways mentioned",
      "Think about systemic changes rather than just fitness improvements"
    ],
    "image_urls": []
  },
  {
    "id": "bbc97b69-943a-4422-9982-f35fc3ff3623",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What is the correct age-specific prevention focus progression according to the article?",
    "question_type": "standalone",
    "options": [
      "20s-30s: Bone mass → 40s-50s: Cardiovascular → 60s+: Cognitive protection",
      "20s-30s: Cardiovascular → 40s-50s: Bone mass → 60s+: Fall prevention",
      "20s-30s: Mental health → 40s-50s: Cancer prevention → 60s+: Metabolic syndrome",
      "All ages: Everything all at once because YOLO and prevention knows no boundaries"
    ],
    "correct_answer_index": 0,
    "explanation": "The article outlines age-specific focuses: building peak bone mass in 20s-30s (you only have until 30!), cardiovascular disease prevention becoming critical in 40s-50s, and cognitive protection against dementia in 60s+.",
    "hints": [
      "Look at the age-specific prevention focus section",
      "Think about what health priorities naturally emerge at different life stages"
    ],
    "image_urls": []
  },
  {
    "id": "699b8b07-09ed-4a4e-b130-f19678806239",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What was Taylor's initial reaction to learning about exercise as disease prevention?",
    "question_type": "passage_based",
    "options": [
      "They immediately signed up for a gym membership",
      "They protested that they don't have time for two-hour gym sessions",
      "They asked for specific medication recommendations instead",
      "They challenged the doctor to an arm wrestling match to test the theory"
    ],
    "correct_answer_index": 1,
    "explanation": "In the passage, when Dr. Martinez explains how exercise can reverse Taylor's concerning health markers, Taylor's immediate response is to protest that they don't have time for two-hour gym sessions.",
    "hints": [
      "Think about Taylor's first reaction when the doctor suggested exercise",
      "Consider what common excuse or concern Taylor immediately raised"
    ],
    "image_urls": [],
    "passage_set_id": "8eb26262-2fde-4674-a47e-9461ffb138ad"
  },
  {
    "id": "7e4211ac-9232-41f3-b9ea-900cfaacb512",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "How did Dr. Martinez respond to Taylor's time concerns about exercise?",
    "question_type": "passage_based",
    "options": [
      "She recommended finding a 24-hour gym for convenience",
      "She suggested that 30 minutes of brisk walking five days a week reduces diabetes risk by 58%",
      "She told Taylor to quit their job to make time for fitness",
      "She prescribed a magical time-multiplying potion (side effects may include temporal displacement)"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Martinez directly addressed Taylor's time concerns by explaining that just 30 minutes of brisk walking five days a week reduces diabetes risk by 58%, emphasizing that this is more effective than medication.",
    "hints": [
      "Focus on the specific solution Dr. Martinez provided for the time problem",
      "Think about the diabetes prevention statistic she mentioned"
    ],
    "image_urls": [],
    "passage_set_id": "8eb26262-2fde-4674-a47e-9461ffb138ad"
  },
  {
    "id": "09e3f847-b9fa-43be-95b7-2e234c89ee50",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What example did Morgan provide to support the doctor's exercise recommendations?",
    "question_type": "passage_based",
    "options": [
      "Their own successful fitness transformation story",
      "Their mother who started walking at 50 and remained medication-free at 72",
      "A celebrity fitness success story from social media",
      "Their pet hamster who runs marathons on a wheel (very inspirational)"
    ],
    "correct_answer_index": 1,
    "explanation": "Morgan shared the story of their mother, who started walking after her pre-diabetes diagnosis at age 50 and was still medication-free at 72, even completing a 5K race.",
    "hints": [
      "Think about the personal family example Morgan shared",
      "Consider the long-term success story that was mentioned"
    ],
    "image_urls": [],
    "passage_set_id": "8eb26262-2fde-4674-a47e-9461ffb138ad"
  },
  {
    "id": "19ac9d92-908d-431a-bb74-8f90fec8c122",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "How did Dr. Martinez conclude the appointment regarding exercise vs. medication?",
    "question_type": "passage_based",
    "options": [
      "She said medications are always better than exercise for disease prevention",
      "She explained that medications treat diseases while exercise prevents them from happening",
      "She recommended both exercise and multiple medications simultaneously",
      "She suggested that exercise is like taking multiple medications at once, but with better side effects (like increased awesomeness)"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Martinez concluded by explaining the key difference: 'Medications treat diseases. Exercise prevents them from happening in the first place,' emphasizing prevention over treatment.",
    "hints": [
      "Think about the final distinction Dr. Martinez made between treatment and prevention",
      "Consider the doctor's perspective on exercise versus medication approaches"
    ],
    "image_urls": [],
    "passage_set_id": "8eb26262-2fde-4674-a47e-9461ffb138ad"
  },
  {
    "id": "9a0fd036-1da0-431c-9e09-aaa05abfa409",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What was Casey's main concern about their family health history?",
    "question_type": "passage_based",
    "options": [
      "Their family had no history of health problems to learn from",
      "They felt doomed because both their father and grandfather had Type 2 diabetes",
      "They were worried about inheriting their family's athletic abilities",
      "They discovered their family tree was actually made of donuts (concerning for obvious reasons)"
    ],
    "correct_answer_index": 1,
    "explanation": "Casey expressed feeling like they were 'just waiting for their turn' because both their father and grandfather had Type 2 diabetes, showing they felt genetically doomed.",
    "hints": [
      "Think about Casey's feelings regarding their family's diabetes history",
      "Consider the sense of inevitability Casey expressed"
    ],
    "image_urls": [],
    "passage_set_id": "64e5f2ad-d6ac-490b-862e-7c3655d19ff8"
  },
  {
    "id": "084c7162-56b6-4660-a88d-e91331155fce",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "How did Riley explain the relationship between genetics and lifestyle?",
    "question_type": "passage_based",
    "options": [
      "Genetics determines everything and lifestyle doesn't matter",
      "Genetics loads the gun, but lifestyle pulls the trigger",
      "Lifestyle is more important than genetics in all cases",
      "Genetics and lifestyle are in a constant arm-wrestling match (genetics usually wins but lifestyle has been hitting the gym)"
    ],
    "correct_answer_index": 1,
    "explanation": "Riley used the powerful metaphor that 'genetics loads the gun, but lifestyle pulls the trigger' to explain that while family history creates predisposition, your choices determine the outcome.",
    "hints": [
      "Think about the specific metaphor Riley used to explain genetic risk",
      "Consider how Riley framed the relationship between inherited risk and personal choices"
    ],
    "image_urls": [],
    "passage_set_id": "64e5f2ad-d6ac-490b-862e-7c3655d19ff8"
  },
  {
    "id": "6c717430-be02-406d-a0b0-6058d4424ee8",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What study example did Riley share about genetics and exercise?",
    "question_type": "passage_based",
    "options": [
      "People with high genetic risk who exercised had the same heart disease risk as low-risk people who didn't exercise",
      "Exercise can completely eliminate all genetic predispositions to disease",
      "Genetics always override the benefits of exercise",
      "People with genetic risks should exercise twice as much to achieve normal benefits (genetics are demanding like that)"
    ],
    "correct_answer_index": 0,
    "explanation": "Riley shared a study showing that people with the highest genetic risk for heart disease who exercised regularly had the same actual risk as people with low genetic risk who didn't exercise, demonstrating exercise's power to 'rewrite genetic destiny.'",
    "hints": [
      "Think about the specific study Riley mentioned about genetic risk and exercise outcomes",
      "Consider how exercise affected people with high versus low genetic risk"
    ],
    "image_urls": [],
    "passage_set_id": "64e5f2ad-d6ac-490b-862e-7c3655d19ff8"
  },
  {
    "id": "748d985f-cba3-4fc9-a370-394547732131",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "How did Riley address Casey's concern about workout frequency?",
    "question_type": "passage_based",
    "options": [
      "They recommended increasing to daily workouts immediately",
      "They emphasized that consistency beats intensity - three workouts a week for life beats sporadic intense phases",
      "They suggested that frequency doesn't matter as much as duration",
      "They revealed the secret: it's not about frequency, it's about workout outfit coordination (consistency in style matters too)"
    ],
    "correct_answer_index": 1,
    "explanation": "When Casey worried that three workouts per week wasn't enough to fight genetics, Riley emphasized that 'consistency beats intensity every time' and that three workouts a week for life is better than sporadic intense phases.",
    "hints": [
      "Think about Riley's philosophy on workout frequency versus intensity",
      "Consider their perspective on long-term consistency"
    ],
    "image_urls": [],
    "passage_set_id": "64e5f2ad-d6ac-490b-862e-7c3655d19ff8"
  },
  {
    "id": "e3edb8cb-d814-4cc5-9113-4ab96d5690b4",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 20,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What was the most significant change Sarah experienced after one year of exercise?",
    "question_type": "passage_based",
    "options": [
      "She lost 15 pounds",
      "Her metabolic age became five years younger than her actual age",
      "She won a fitness competition",
      "She gained the ability to bench press her own body weight (and possibly small cars)"
    ],
    "correct_answer_index": 1,
    "explanation": "While Sarah mentioned losing 15 pounds, she emphasized that wasn't even the best part. Her doctor found that her metabolic age was now five years younger than her actual age, along with numerous other health improvements.",
    "hints": [
      "Think about what Sarah said wasn't the best part of her transformation",
      "Consider the most dramatic health marker change mentioned"
    ],
    "image_urls": [],
    "passage_set_id": "5e708847-a190-4017-af20-c4f3b21825d7"
  },
  {
    "id": "1a0adc9d-f460-41e6-820f-a98744a2f48d",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 21,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "How did Marcus explain the compound effect of exercise benefits?",
    "question_type": "passage_based",
    "options": [
      "Benefits plateau after the first year of exercise",
      "Disease risk reduction increases from 30% at year 1 to 45% at year 5 to a different category at year 10",
      "All exercise benefits happen immediately and remain constant",
      "The compound effect works like compound interest, except instead of money you're earning the ability to outrun zombies in the apocalypse"
    ],
    "correct_answer_index": 1,
    "explanation": "Marcus explained that Sarah was already reducing major disease risk by 30%, and this compounds over time - jumping to 45% at five years, and putting her in a completely different risk category at ten years.",
    "hints": [
      "Think about the specific percentages Marcus mentioned for different time periods",
      "Consider how risk reduction changes over years of consistent exercise"
    ],
    "image_urls": [],
    "passage_set_id": "5e708847-a190-4017-af20-c4f3b21825d7"
  },
  {
    "id": "56482961-27a4-4ddb-8e65-80decc5543fa",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 22,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What comparison did Marcus make about exercise as a pill?",
    "question_type": "passage_based",
    "options": [
      "Exercise pills should be developed by pharmaceutical companies",
      "If exercise was a pill, it would be the most prescribed medication in the world",
      "Pills are always better than exercise for health benefits",
      "Exercise is like a magical pill that also improves your ability to open pickle jars (very important life skill)"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah shared what her doctor told her: 'if exercise was a pill, it would be the most prescribed medication in the world' because it simultaneously prevents multiple diseases - heart disease, diabetes, several cancers, depression, and osteoporosis.",
    "hints": [
      "Think about the doctor's hypothetical comparison about exercise",
      "Consider why exercise would be so widely prescribed if it were available as medication"
    ],
    "image_urls": [],
    "passage_set_id": "5e708847-a190-4017-af20-c4f3b21825d7"
  },
  {
    "id": "040a0cf7-e31b-4743-a5d3-86f5b75dfdc5",
    "created_at": "2024-01-01T00:00:00Z",
    "updated_at": "2024-01-01T00:00:00Z",
    "is_active": true,
    "sort_order": 23,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d489",
    "question_text": "What example did Emma provide to illustrate the long-term benefits of consistent exercise?",
    "question_type": "passage_based",
    "options": [
      "Her own transformation story over the past year",
      "Her grandmother who gardens daily at 85 after walking since her 40s, compared to her sedentary sister who needed a walker at 75",
      "A celebrity fitness success story she read online",
      "Her pet turtle who has been doing yoga for 30 years and is remarkably flexible (for a turtle)"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma shared the contrasting stories of her grandmother, who has been walking daily since her 40s and still gardens at 85, versus her sedentary sister who needed a walker at 75, illustrating the compound effect of lifelong exercise habits.",
    "hints": [
      "Think about the family comparison Emma made",
      "Consider the contrast between two different approaches to aging and activity"
    ],
    "image_urls": [],
    "passage_set_id": "5e708847-a190-4017-af20-c4f3b21825d7"
  },
  {
    "id": "8cbbf61d-4595-4337-aa1c-8347deba9a49",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "Weight can fluctuate 2-5 pounds in a single day based on factors like water retention and digestive contents.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "Daily weight fluctuations of 2-5 pounds are completely normal and can be caused by water retention from sodium or carbs, hormonal changes, digestive contents, muscle inflammation, and time of day.",
    "hints": [
      "Think about what your body contains besides fat and muscle",
      "Consider why athletes weigh themselves at the same time daily"
    ],
    "image_urls": []
  },
  {
    "id": "5b34447a-7e99-4763-aa4f-64b647742702",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "A healthy resting heart rate for most adults is 60-100 beats per minute.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "The normal resting heart rate range for adults is 60-100 beats per minute, with trained athletes often having rates between 40-60 BPM due to improved cardiovascular efficiency.",
    "hints": [
      "Athletes typically have lower resting heart rates",
      "This should be measured first thing in the morning"
    ],
    "image_urls": []
  },
  {
    "id": "16b0be41-fd32-41e6-bd49-ce79ede933bf",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "Waist circumference is a better predictor of health risks than total body weight.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "Waist circumference indicates visceral fat distribution, which is metabolically active and linked to numerous health issues. It's a more accurate predictor of health risks than weight alone.",
    "hints": [
      "Think about where fat is stored and its metabolic activity",
      "Consider why belly fat is particularly concerning"
    ],
    "image_urls": []
  },
  {
    "id": "3a921d30-ceb1-4fd1-998d-d5d3fe874a5a",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "Good recovery heart rate means your heart rate drops 50+ beats within 2 minutes after moderate exercise.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "A heart rate drop of 50+ beats within 2 minutes post-exercise indicates excellent cardiovascular fitness. Even a 15-25 beat drop in the first minute shows good recovery.",
    "hints": [
      "This measures how quickly your cardiovascular system recovers",
      "Better fitness = faster heart rate recovery"
    ],
    "image_urls": []
  },
  {
    "id": "c6ee60cb-d011-4715-b95c-5b155b4d6449",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "When you've been exercising for months but the scale hasn't budged, what's the most likely explanation?",
    "question_type": "standalone",
    "options": [
      "Your body has entered 'starvation mode' and stopped losing weight",
      "You're gaining muscle while losing fat, resulting in body recomposition",
      "The scale is broken and needs to be replaced",
      "You're secretly sleepwalking to the fridge every night"
    ],
    "correct_answer_index": 1,
    "explanation": "Body recomposition - gaining muscle while losing fat - often results in stable weight despite positive body changes. This is why measurements and how clothes fit are better indicators than weight alone.",
    "hints": [
      "Muscle tissue is denser than fat tissue",
      "Think about what else might be changing besides weight"
    ],
    "image_urls": []
  },
  {
    "id": "27346603-02ad-4fce-a911-bf6382f54fae",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What's the most practical way to track your resting heart rate as a beginner?",
    "question_type": "standalone",
    "options": [
      "Use expensive medical equipment for maximum accuracy",
      "Check your pulse first thing in the morning before getting out of bed",
      "Take your heart rate immediately after drinking coffee",
      "Hire a nurse to monitor you 24/7"
    ],
    "correct_answer_index": 1,
    "explanation": "The most practical and accurate method is checking your pulse first thing in the morning before getting out of bed, when you're truly at rest and haven't been influenced by movement, food, or stimulants.",
    "hints": [
      "When would your body be most at rest?",
      "Consider what factors might artificially raise heart rate"
    ],
    "image_urls": []
  },
  {
    "id": "0cf23c2f-63a5-4cc3-959d-72ee852c0811",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "Which health risk threshold indicates you should pay attention to your waist measurement?",
    "question_type": "standalone",
    "options": [
      "Men over 35 inches, women over 30 inches",
      "Men over 40 inches, women over 35 inches",
      "Men over 32 inches, women over 28 inches",
      "Anyone whose waist measurement equals their favorite pizza size"
    ],
    "correct_answer_index": 1,
    "explanation": "Health risk increases when waist circumference exceeds 40 inches for men or 35 inches for women. These thresholds indicate increased risk of metabolic disorders and cardiovascular disease.",
    "hints": [
      "These are medical guidelines, not fashion advice",
      "The thresholds are different for men and women"
    ],
    "image_urls": []
  },
  {
    "id": "d2e84004-79d1-4683-b437-30b95c4dd92e",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What's the best approach for tracking functional fitness improvements?",
    "question_type": "standalone",
    "options": [
      "Only use expensive gym equipment for testing",
      "Focus exclusively on how much weight you can lift",
      "Track real-world activities like climbing stairs without getting winded",
      "Hire a personal trainer to test you weekly"
    ],
    "correct_answer_index": 2,
    "explanation": "Functional fitness is best measured by improvements in daily activities - climbing stairs easily, carrying groceries without fatigue, playing with kids without exhaustion. These real-world improvements matter most for quality of life.",
    "hints": [
      "Think about what fitness improvements you'd notice in daily life",
      "Consider what makes life easier and more enjoyable"
    ],
    "image_urls": []
  },
  {
    "id": "80c0592f-5d74-4f11-833b-9dcf72694af5",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "Which sequence represents the ideal frequency for tracking different health markers?",
    "question_type": "standalone",
    "options": [
      "Daily weight, weekly measurements, monthly photos, quarterly assessments",
      "Weekly resting heart rate, monthly measurements, daily photos, yearly assessments",
      "Monthly weight, weekly measurements, quarterly photos, daily assessments",
      "Hourly weight, daily measurements, weekly photos, monthly assessments"
    ],
    "correct_answer_index": 0,
    "explanation": "The optimal tracking schedule balances useful data with avoiding obsession: daily weight for trends, weekly measurements for body changes, monthly photos for visual progress, and quarterly comprehensive assessments.",
    "hints": [
      "Consider how often different metrics actually change meaningfully",
      "Think about avoiding obsessive daily checking of everything"
    ],
    "image_urls": []
  },
  {
    "id": "1fd13b9c-440f-4908-944e-c8ce4cec6dd1",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What combination of measurements gives you the most complete picture of body composition changes?",
    "question_type": "standalone",
    "options": [
      "Weight and height only",
      "Weight, waist circumference, and progress photos",
      "Just the scale reading",
      "Weight, shoe size, and hair length"
    ],
    "correct_answer_index": 1,
    "explanation": "The combination of weight (for overall trends), waist circumference (for fat distribution), and progress photos (for visual changes) provides a comprehensive view of body composition changes that single measurements miss.",
    "hints": [
      "Think about what each measurement tells you",
      "Consider how different measurements complement each other"
    ],
    "image_urls": []
  },
  {
    "id": "5a0ef35a-4589-4136-8c6a-519a41c95df0",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "Which blood work markers typically improve with regular exercise?",
    "question_type": "standalone",
    "options": [
      "Higher fasting glucose, lower HDL cholesterol, higher triglycerides",
      "Lower fasting glucose, higher HDL cholesterol, lower triglycerides",
      "Higher everything across the board",
      "Lower everything including the good markers"
    ],
    "correct_answer_index": 1,
    "explanation": "Regular exercise typically improves blood markers by lowering fasting glucose, raising HDL (good) cholesterol, lowering LDL and triglycerides, and reducing inflammatory markers - all indicating better metabolic health.",
    "hints": [
      "Think about what 'improvement' means for different types of cholesterol",
      "Consider how exercise affects blood sugar control"
    ],
    "image_urls": []
  },
  {
    "id": "445c399b-bb09-436d-9e0e-96cba14ed671",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What was Taylor's main concern when visiting Dr. Martinez?",
    "question_type": "passage_based",
    "options": [
      "They had gained too much weight recently",
      "They were confused why diet alone wasn't showing scale results",
      "They were experiencing chest pain during exercise",
      "They wanted to become a professional athlete"
    ],
    "correct_answer_index": 1,
    "explanation": "Taylor was frustrated because they had been dieting for months but the scale barely moved, leading them to think their efforts weren't working. Dr. Martinez helped them understand that health improvements happen beyond just weight changes.",
    "hints": [
      "Focus on Taylor's specific complaint to the doctor",
      "Think about what was motivating the doctor visit"
    ],
    "image_urls": [],
    "passage_set_id": "29aa34bc-1091-408d-bfe9-164f13b7df34"
  },
  {
    "id": "526275a6-0ed1-4b20-a3d7-6495eeecd73c",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "According to Dr. Martinez, what health markers were more concerning than Taylor's weight?",
    "question_type": "passage_based",
    "options": [
      "Their height and shoe size",
      "Their blood pressure (138/88) and fasting glucose (108)",
      "Their hair color and eye color",
      "Their exercise frequency and diet quality"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Martinez specifically mentioned that Taylor's weight was fine, but their blood pressure of 138/88 and fasting glucose of 108 were more concerning indicators of health status than the scale number.",
    "hints": [
      "Look for the specific numbers Dr. Martinez mentioned",
      "Think about what medical markers she was concerned about"
    ],
    "image_urls": [],
    "passage_set_id": "29aa34bc-1091-408d-bfe9-164f13b7df34"
  },
  {
    "id": "94909d73-1ac0-499f-9071-81c7e30eff07",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What did Jordan share about their own experience with fitness tracking?",
    "question_type": "passage_based",
    "options": [
      "They lost 50 pounds in 6 months",
      "They gained 3 pounds but had positive changes in waist size and energy",
      "They quit exercising because the scale didn't move",
      "They became a professional fitness trainer"
    ],
    "correct_answer_index": 1,
    "explanation": "Jordan mentioned that when they started strength training, they gained 3 pounds but their waist got smaller and their energy increased significantly, demonstrating that positive changes can occur despite weight gain.",
    "hints": [
      "Focus on Jordan's personal story about weight vs. other improvements",
      "Think about what happened when Jordan started strength training"
    ],
    "image_urls": [],
    "passage_set_id": "29aa34bc-1091-408d-bfe9-164f13b7df34"
  },
  {
    "id": "4e1ab46d-d40a-40bc-8425-5d80fabe82f8",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What tracking approach did Dr. Martinez recommend for Taylor?",
    "question_type": "passage_based",
    "options": [
      "Weigh yourself daily and focus only on the scale",
      "Track resting heart rate, take monthly measurements, and note energy levels",
      "Hire a personal trainer to track everything for you",
      "Don't track anything and just exercise randomly"
    ],
    "correct_answer_index": 1,
    "explanation": "Dr. Martinez specifically recommended that Taylor start tracking their resting heart rate, take monthly body measurements, and note their energy levels, focusing on health markers beyond just weight.",
    "hints": [
      "Look for the specific tracking recommendations Dr. Martinez made",
      "Think about what would give Taylor a fuller picture of their health"
    ],
    "image_urls": [],
    "passage_set_id": "29aa34bc-1091-408d-bfe9-164f13b7df34"
  },
  {
    "id": "8fa02b8a-5ca2-49d2-9e4d-aeab03a91270",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What measurement change did Sarah discover during her tracking session with Emma?",
    "question_type": "passage_based",
    "options": [
      "She had gained 2 inches around her waist",
      "She had lost an inch from her waist (down to 32 inches)",
      "Her weight had dropped by 10 pounds",
      "Her height had mysteriously increased"
    ],
    "correct_answer_index": 1,
    "explanation": "Sarah discovered that her waist measurement had decreased by an inch to 32 inches, which was a positive change that the scale hadn't reflected, showing the value of taking body measurements.",
    "hints": [
      "Focus on the specific measurement Sarah took and her reaction",
      "Think about what positive change Sarah discovered"
    ],
    "image_urls": [],
    "passage_set_id": "660b75e6-5255-44c2-bb27-f0f70ac00ad3"
  },
  {
    "id": "0064b375-0b51-4ce0-a494-8ddaa4666740",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What change did Emma notice in her fitness tracker data?",
    "question_type": "passage_based",
    "options": [
      "Her step count had doubled",
      "Her resting heart rate had dropped from 75 to 68",
      "Her sleep quality had improved dramatically",
      "Her blood pressure had normalized"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma noted that her resting heart rate had decreased from 75 to 68 beats per minute, which indicated improved cardiovascular fitness even though her weight had remained the same.",
    "hints": [
      "Look for the specific fitness tracker data Emma mentioned",
      "Think about what heart rate change indicates improved fitness"
    ],
    "image_urls": [],
    "passage_set_id": "660b75e6-5255-44c2-bb27-f0f70ac00ad3"
  },
  {
    "id": "e4884c13-b54a-429a-a5b0-c5592916f8f1",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "What functional fitness improvement did both Sarah and Emma experience?",
    "question_type": "passage_based",
    "options": [
      "They could both deadlift 200 pounds",
      "They could run marathons without training",
      "They had improved stair-climbing endurance and energy for playing with kids",
      "They became professional athletes"
    ],
    "correct_answer_index": 2,
    "explanation": "Both women experienced improvements in real-world functional fitness - Sarah could run up stairs twice without getting winded, and Emma could play tag with her kids without getting tired, demonstrating practical fitness gains.",
    "hints": [
      "Focus on the daily life activities they mentioned",
      "Think about practical improvements they both experienced"
    ],
    "image_urls": [],
    "passage_set_id": "660b75e6-5255-44c2-bb27-f0f70ac00ad3"
  },
  {
    "id": "110bca58-5056-48b7-beee-fe38885a2465",
    "created_at": "2024-12-20T10:00:00Z",
    "updated_at": "2024-12-20T10:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d490",
    "question_text": "How did Sarah's attitude toward the scale change by the end of the passage?",
    "question_type": "passage_based",
    "options": [
      "She became obsessed with weighing herself daily",
      "She threw her scale away in frustration",
      "She adopted a 'who cares?' attitude toward scale weight while focusing on other metrics",
      "She decided to only weigh herself once per year"
    ],
    "correct_answer_index": 2,
    "explanation": "Sarah's final note showed her attitude shift - she recorded positive changes in energy, mood, and how her clothes fit, ending with 'Scale: Who cares?' indicating she now prioritized other health markers over weight.",
    "hints": [
      "Look at what Sarah wrote in her final notebook entry",
      "Think about how her perspective on the scale changed"
    ],
    "image_urls": [],
    "passage_set_id": "660b75e6-5255-44c2-bb27-f0f70ac00ad3"
  },
  {
    "id": "e494ceaa-519b-4ade-a5b2-9614c7fb7263",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 1,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "True or False: Fitness trackers are 100% accurate in measuring calories burned during workouts.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The article clearly states that no fitness tracker is 100% accurate and that calorie estimates can be off by 20-40%. The article advises to use calorie estimates for comparing workouts, not for eating back calories.",
    "hints": [
      "The article mentions fitness trackers 'notoriously overestimate' certain metrics",
      "Consider what the article says about consistency vs. perfection in tracking"
    ],
    "image_urls": []
  },
  {
    "id": "d3da95dd-0183-4718-95b1-879ddf5f213c",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 2,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "True or False: The 10,000 steps daily goal is based on scientific research into optimal health outcomes.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The article reveals that the 10,000 steps goal came from a 1960s Japanese marketing campaign for a pedometer, not scientific research. Research shows health benefits start at 7,500 steps and plateau around 12,000.",
    "hints": [
      "Look for what the article says about the origin of the 10,000 steps goal",
      "The article mentions this came from a marketing campaign, not science"
    ],
    "image_urls": []
  },
  {
    "id": "dab3a941-a5ed-46cf-b91c-368e181e98b7",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 3,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "True or False: Your smartphone with free apps can provide everything needed to start tracking fitness effectively.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 0,
    "explanation": "True. The article emphasizes that your phone + a free app = everything you need to start. Most phones have built-in step counters and can run free apps like Google Fit, Nike Training Club, and Strava.",
    "hints": [
      "The article has a section specifically about budget-conscious beginners",
      "Look at what the article recommends for the '$0-30' category"
    ],
    "image_urls": []
  },
  {
    "id": "d8b00e62-eea8-4ebe-bb7e-bc950916c6ac",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 4,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "True or False: Advanced metrics like VO2 max and HRV should be the primary focus for fitness beginners using wearables.",
    "question_type": "standalone",
    "options": [
      "True",
      "False"
    ],
    "correct_answer_index": 1,
    "explanation": "False. The article warns against ignoring basics for advanced metrics and states 'Master sleep, steps, and consistency before advanced metrics.' It emphasizes starting simple with 1-3 basic metrics initially.",
    "hints": [
      "The article lists this as a common mistake beginners make",
      "Consider what the article says about mastering basics first"
    ],
    "image_urls": []
  },
  {
    "id": "efc0bd99-58f1-4b08-9e35-ddc42fdb3bb3",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 5,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "When your fitness tracker says you burned 600 calories in a spin class, what should you realistically expect for diet planning purposes?",
    "question_type": "standalone",
    "options": [
      "Use the full 600 calories",
      "Cut that number in half to about 300 calories",
      "Add 20% more for safety margin",
      "Ignore calorie tracking completely and eat pizza"
    ],
    "correct_answer_index": 1,
    "explanation": "Cut that number in half. The article specifically states: 'Your tracker says you burned 600 calories in that spin class? Cut that number in half for realistic diet planning.' Trackers notoriously overestimate calorie burn.",
    "hints": [
      "The article has a section called 'Calories: The Biggest Lie Your Tracker Tells'",
      "Look for the specific advice about cutting calorie estimates"
    ],
    "image_urls": []
  },
  {
    "id": "c871f7d0-1376-4f65-8cd8-3b37c622866b",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 6,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "According to the article, what's the main reason 77% of fitness tracker owners abandon their devices within six months?",
    "question_type": "standalone",
    "options": [
      "The devices break easily",
      "Nobody taught them how to use these tools effectively",
      "They're too expensive to maintain",
      "They cause skin allergies and rashes"
    ],
    "correct_answer_index": 1,
    "explanation": "Nobody taught them how to use these tools effectively. The article opens with this statistic and explains it's 'Not because the tech is bad, but because nobody taught them how to use these tools effectively.'",
    "hints": [
      "This statistic appears in the opening of the article",
      "The reason is about education, not hardware issues"
    ],
    "image_urls": []
  },
  {
    "id": "d8140649-01c3-4d5d-a7a3-2666025e466d",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 7,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What does Zone 2 heart rate feel like during exercise?",
    "question_type": "standalone",
    "options": [
      "You could sing your favorite song",
      "You can hold a conversation easily",
      "You can talk, but you'd rather not",
      "You can teach your tracker to play fetch"
    ],
    "correct_answer_index": 1,
    "explanation": "Zone 2 (60-70% max HR) feels like 'You can hold a conversation easily.' The article provides practical descriptions for each heart rate zone to help beginners understand effort levels without complex calculations.",
    "hints": [
      "The article provides feel-based descriptions for different heart rate zones",
      "Zone 2 is described as conversational pace"
    ],
    "image_urls": []
  },
  {
    "id": "df9d5038-7cdb-4589-a2e3-09cefbf828a8",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 8,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "For someone just starting with fitness tracking, which approach does the article recommend?",
    "question_type": "standalone",
    "options": [
      "Download 15 fitness apps to cover all possible metrics",
      "Pick one main app for each purpose (workout, nutrition, wearable)",
      "Only use the most expensive tracker with all features",
      "Track every metric available to optimize performance immediately"
    ],
    "correct_answer_index": 1,
    "explanation": "Pick one main app for each purpose. The article warns against 'app overload' and advises: 'Pick ONE main app for each purpose: One for workout tracking, One for nutrition (if you're tracking food), One for your wearable device. That's it.'",
    "hints": [
      "The article has a section about 'Avoiding App Overload'",
      "The solution emphasizes simplicity and focus"
    ],
    "image_urls": []
  },
  {
    "id": "9d9a0e68-4243-4f27-986b-18290f481430",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 9,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "Which sequence represents the correct progression for adding fitness tracking metrics according to the article?",
    "question_type": "standalone",
    "options": [
      "Start with all metrics immediately, then remove unnecessary ones",
      "Begin with steps only, then add one metric per month",
      "Focus on advanced metrics first, then add basic ones",
      "Track sleep quality, then VO2 max, then daily steps"
    ],
    "correct_answer_index": 1,
    "explanation": "Begin with steps only, then add one metric per month. The article recommends starting simple and gradually adding complexity, specifically mentioning adding one metric per month as you get comfortable.",
    "hints": [
      "Look for advice about gradual progression in tracking",
      "The article emphasizes starting simple before adding complexity"
    ],
    "image_urls": []
  },
  {
    "id": "80546d11-bb97-48e4-9945-9b8378739f02",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 10,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What combination of factors makes fitness trackers most valuable according to the article?",
    "question_type": "standalone",
    "options": [
      "Perfect accuracy + expensive hardware + multiple metrics",
      "Consistent use + trend tracking + realistic expectations",
      "Social features + gamification + daily challenges",
      "Medical-grade sensors + AI coaching + cloud storage"
    ],
    "correct_answer_index": 1,
    "explanation": "Consistent use + trend tracking + realistic expectations. The article emphasizes that 'consistency matters more than perfection' and that trackers are valuable for showing trends over time, not perfect daily accuracy.",
    "hints": [
      "The article repeatedly mentions that trends matter more than accuracy",
      "Consider what makes tracking sustainable long-term"
    ],
    "image_urls": []
  },
  {
    "id": "3446f208-4c6e-49e9-941c-26fb2cebb80c",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 11,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "Which combination best represents the article's recommended approach to fitness technology for beginners?",
    "question_type": "standalone",
    "options": [
      "Buy the most expensive device + track everything + compare with others daily",
      "Start simple + track consistently + upgrade when you outgrow current tools",
      "Wait for perfect technology + research for months + then buy premium",
      "Use multiple devices + cross-reference all data + optimize immediately"
    ],
    "correct_answer_index": 1,
    "explanation": "Start simple + track consistently + upgrade when you outgrow current tools. This aligns with the article's conclusion: 'Start simple. Track consistently. Upgrade when you've outgrown your current tool. That's how you make fitness tech work for you, not the other way around.'",
    "hints": [
      "Look at the article's final recommendations in the conclusion",
      "The article emphasizes progression from simple to complex"
    ],
    "image_urls": []
  },
  {
    "id": "8b0b390c-6f9f-4ae8-b6d5-52d13a7bc197",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 12,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "In the first passage, what was Emma's main issue with her fitness tracker?",
    "question_type": "passage_based",
    "options": [
      "The battery died too quickly",
      "It kept telling her negative things about her health metrics",
      "It was too expensive and she couldn't afford it",
      "It didn't sync properly with her phone"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma's tracker kept telling her negative things - that her stress levels were high, she wasn't sleeping enough, and her VO2 max was below average. She described it as providing guilt rather than helpful motivation.",
    "hints": [
      "Emma describes her tracker as '$300 of guilt'",
      "Look at what specific feedback the tracker was giving Emma"
    ],
    "image_urls": [],
    "passage_set_id": "0a8494bd-e183-4aa8-b466-cb982e50fcea"
  },
  {
    "id": "adecd3e6-24e3-4115-a9ae-c94bc382b405",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 13,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What approach did Mike suggest for successfully using a fitness tracker?",
    "question_type": "passage_based",
    "options": [
      "Focus on absolute accuracy and perfect data",
      "Ignore the device completely when it gives wrong readings",
      "Focus on trends rather than daily accuracy and start with one metric",
      "Use multiple devices to cross-reference all measurements"
    ],
    "correct_answer_index": 2,
    "explanation": "Mike advised focusing on trends rather than absolute accuracy and starting with just one metric (steps), gradually adding more features over time. He emphasized that trends show real progress even when daily readings aren't perfect.",
    "hints": [
      "Mike showed Emma his step trend over six months",
      "Consider Mike's advice about starting with just one metric"
    ],
    "image_urls": [],
    "passage_set_id": "0a8494bd-e183-4aa8-b466-cb982e50fcea"
  },
  {
    "id": "c9e125f4-eda5-49e4-906d-dab6955c7607",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 14,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What analogy did Mike use to explain the proper approach to fitness tracker features?",
    "question_type": "passage_based",
    "options": [
      "Like learning to drive - start with basics before advanced features",
      "Like using every machine at the gym on your first day",
      "Like cooking - you need all ingredients at once",
      "Like reading - you should finish the whole book immediately"
    ],
    "correct_answer_index": 1,
    "explanation": "Mike said 'You wouldn't use every machine at the gym on your first day, right? Same principle.' This analogy emphasized starting with basics rather than overwhelming yourself with all available features immediately.",
    "hints": [
      "Mike compares tracker features to something at the gym",
      "The analogy is about not doing everything at once as a beginner"
    ],
    "image_urls": [],
    "passage_set_id": "0a8494bd-e183-4aa8-b466-cb982e50fcea"
  },
  {
    "id": "a505349a-8e60-4890-9bcf-2fb65be12638",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 15,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "Based on the passage, what was Emma's pattern of tracker usage that led to abandonment?",
    "question_type": "passage_based",
    "options": [
      "She used it consistently but got bored with the features",
      "She had sporadic usage - intensive periods followed by complete stops",
      "She never learned how to charge it properly",
      "She only used it during workouts but not daily activities"
    ],
    "correct_answer_index": 1,
    "explanation": "Emma had 14 days of data from January, 6 from February, then nothing - showing a pattern of intensive use followed by complete abandonment rather than consistent daily use.",
    "hints": [
      "Look at Emma's usage pattern when she checked her app",
      "Notice the gap between her usage months"
    ],
    "image_urls": [],
    "passage_set_id": "0a8494bd-e183-4aa8-b466-cb982e50fcea"
  },
  {
    "id": "4b94f418-43e9-4741-a7ec-22dced81fc05",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 16,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What was Riley's main concern about using fitness tracking technology?",
    "question_type": "passage_based",
    "options": [
      "They were worried about privacy and data security",
      "They couldn't afford the expensive fitness trackers",
      "They thought phone-based tracking wouldn't be scientific enough",
      "They were confused by too many app options available"
    ],
    "correct_answer_index": 1,
    "explanation": "Riley said the cheapest decent tracker was 'still a week of groceries,' indicating cost was the primary barrier. They were looking at fitness trackers online with a calculator app to determine affordability.",
    "hints": [
      "Riley was using a calculator while looking at trackers",
      "Consider what Riley said about the cost comparison"
    ],
    "image_urls": [],
    "passage_set_id": "211eea15-0c72-47e9-8289-c8990ffd1522"
  },
  {
    "id": "23c08a05-45e9-462a-840b-f5eba92235ea",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 17,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "How did Casey track heart rate during workouts without a wearable device?",
    "question_type": "passage_based",
    "options": [
      "They used a separate chest strap monitor",
      "They manually checked their pulse every few minutes",
      "They used the 'talk test' to gauge exercise intensity",
      "They estimated based on how much they were sweating"
    ],
    "correct_answer_index": 2,
    "explanation": "Casey used the 'talk test': 'Can I hold a conversation? I'm in zone 2. Can I only grunt single words? Too hard.' This method has 'worked for decades before heart rate monitors existed.'",
    "hints": [
      "Casey mentions a method that worked before heart rate monitors existed",
      "The method involves assessing ability to speak during exercise"
    ],
    "image_urls": [],
    "passage_set_id": "211eea15-0c72-47e9-8289-c8990ffd1522"
  },
  {
    "id": "f74deceb-0e9c-4aee-aec6-e5f73e79e947",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 18,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What was Casey's progression strategy for fitness technology purchases?",
    "question_type": "passage_based",
    "options": [
      "Buy the best device immediately to avoid upgrading later",
      "Start with phone and free apps, prove consistency, then buy basic tracker",
      "Wait for the latest technology before making any purchase",
      "Ask friends for recommendations and buy the most popular option"
    ],
    "correct_answer_index": 1,
    "explanation": "Casey started with phone and free apps (MyFitnessPal, Nike Training) at zero cost, proved they'd stick with it for three months, then bought a $40 Mi Band only after establishing the habit.",
    "hints": [
      "Casey mentions proving something to themselves for a specific time period",
      "Look at the sequence of Casey's technology adoption"
    ],
    "image_urls": [],
    "passage_set_id": "211eea15-0c72-47e9-8289-c8990ffd1522"
  },
  {
    "id": "b957bbbf-76de-4b67-90fb-24b1daf3003f",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 19,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "According to Casey, what are the essential features needed for a beginner's fitness tracker?",
    "question_type": "passage_based",
    "options": [
      "GPS tracking, smartphone notifications, and music storage",
      "Tells time, counts steps, tracks sleep, and long battery life",
      "Heart rate monitoring, calorie counting, and workout detection",
      "Social features, coaching programs, and data analytics"
    ],
    "correct_answer_index": 1,
    "explanation": "Casey said their Mi Band 'tells time, counts steps, tracks sleep, and the battery lasts two weeks. What else do I really need as a beginner?' emphasizing simplicity over advanced features.",
    "hints": [
      "Casey asks what else they really need as a beginner",
      "Focus on the basic features Casey mentions their simple tracker provides"
    ],
    "image_urls": [],
    "passage_set_id": "211eea15-0c72-47e9-8289-c8990ffd1522"
  },
  {
    "id": "283b9831-c93d-437f-a3cf-80d7dad70932",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 20,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What was Jordan's main problem in the third passage?",
    "question_type": "passage_based",
    "options": [
      "They couldn't afford multiple tracking devices",
      "They were overwhelmed by conflicting data from various metrics",
      "Their devices kept breaking and needed constant replacement",
      "They were getting inaccurate readings from all their trackers"
    ],
    "correct_answer_index": 1,
    "explanation": "Jordan was paralyzed by conflicting metrics: 'My HRV suggests I need recovery, but my body battery is at 82, and my training readiness says moderate intensity is fine. But then my sleep score was only 67...' They couldn't decide what to do.",
    "hints": [
      "Jordan lists multiple conflicting recommendations from different metrics",
      "Alex points out what Jordan has replaced actual exercise with"
    ],
    "image_urls": [],
    "passage_set_id": "38e7c274-a484-4be5-a0af-9fc9478ac7ef"
  },
  {
    "id": "61432d67-64f4-4471-802d-5077c2954b5d",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 21,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What insight did Alex share about when fitness tracking data becomes meaningful?",
    "question_type": "passage_based",
    "options": [
      "Data is meaningful from the first day of tracking",
      "You need at least 4-6 weeks of consistent information before metrics mean anything",
      "Only expensive devices provide meaningful data",
      "Data is only useful if you track every possible metric"
    ],
    "correct_answer_index": 1,
    "explanation": "Alex told Jordan: 'You need at least 4-6 weeks of consistent information before those fancy metrics mean anything. And even then...' emphasizing that meaningful patterns require time to develop.",
    "hints": [
      "Alex mentions a specific time period for data to become meaningful",
      "Consider what Alex says about patterns and consistency"
    ],
    "image_urls": [],
    "passage_set_id": "38e7c274-a484-4be5-a0af-9fc9478ac7ef"
  },
  {
    "id": "46179a92-bcc8-4932-b584-3a03c9ea689a",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 22,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "How did Alex demonstrate the proper relationship with fitness tracking technology?",
    "question_type": "passage_based",
    "options": [
      "By using multiple devices to ensure accuracy",
      "By following all device recommendations without question",
      "By ignoring the watch's recovery recommendation because they felt great",
      "By spending equal time analyzing data and exercising"
    ],
    "correct_answer_index": 2,
    "explanation": "Alex said 'My watch says I need a recovery day. You know what? I feel great, so I'm ignoring it,' demonstrating that technology should inform decisions, not make them.",
    "hints": [
      "Alex explains their watch says one thing, but they plan to do another",
      "Consider Alex's philosophy about who should make the final decision"
    ],
    "image_urls": [],
    "passage_set_id": "38e7c274-a484-4be5-a0af-9fc9478ac7ef"
  },
  {
    "id": "9c520542-89f2-4d76-b494-604887a7ec5c",
    "created_at": "2025-01-15T10:00:00Z",
    "updated_at": "2025-01-15T10:00:00Z",
    "is_active": true,
    "sort_order": 23,
    "knowledge_base_id": "f47ac10b-58cc-4372-a567-0e02b2c3d491",
    "question_text": "What was Alex's main advice to Jordan about using fitness technology?",
    "question_type": "passage_based",
    "options": [
      "Upgrade to more expensive devices for better accuracy",
      "Use technology to inform decisions, not make them",
      "Focus on optimizing all metrics before working out",
      "Collect more data to resolve conflicting recommendations"
    ],
    "correct_answer_index": 1,
    "explanation": "Alex's key message was 'Use the tech to inform your decisions, not make them' and emphasized that the purpose is to be healthier and fitter, not to obey an algorithm that doesn't know personal context.",
    "hints": [
      "Alex gives a direct quote about the relationship between tech and decisions",
      "Consider what Alex says about the true purpose of fitness"
    ],
    "image_urls": [],
    "passage_set_id": "38e7c274-a484-4be5-a0af-9fc9478ac7ef"
  }
]