[
  {
    "id": "fitness-foundation",
    "name": "Fitness Foundation & Getting Started",
    "description": "Essential fitness basics for absolute beginners. Learn what fitness really means, understand key safety principles, and discover the fundamental building blocks needed to start your fitness journey with confidence.",
    "icon_name": "flag-checkered",
    "is_active": true,
    "sort_order": 1,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Define the main components of physical fitness",
      "Identify recommended weekly exercise guidelines for beginners",
      "Recognize essential safety considerations before starting exercise",
      "Distinguish between fitness myths and evidence-based practices",
      "Understand the importance of gradual progression",
      "Learn basic fitness terminology and concepts",
      "How fitness can be adaptable to your circumstances. It can meet you where you are and help you get to where you want to be.",
      "The role of nutrition in fitness",
      "Recognize signs of appropriate exercise intensity",
      "Understand the role of consistency in fitness success",
      "Identify when to seek professional guidance",
      "Talking to an Health professional before starting a fitness program, particularly for those who haven't done so in a while and also those with a history of health conditions", 
      "Establish realistic expectations for fitness outcomes"
    ],
    "related_categories": ["exercise-fundamentals", "mindset-motivation", "health-lifestyle"]
  },
  {
    "id": "exercise-fundamentals",
    "name": "Exercise Fundamentals & Form",
    "description": "Master proper exercise technique and movement patterns. Learn the building blocks of safe, effective exercise including breathing, form cues, and how to progress exercises as you get stronger.",
    "icon_name": "target",
    "is_active": true,
    "sort_order": 2,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Demonstrate proper breathing techniques during exercise",
      "Recognize correct posture and alignment cues",
      "Understand progression principles from beginner to intermediate",
      "Master basic bodyweight movement patterns",
      "Identify common form mistakes and corrections",
      "Understand the difference between eccentric and concentric movements",
      "Learn how to modify exercises for different fitness levels",
      "How different anatomy and biomechanics influence movement and form",
      "Recognize signs of using appropriate resistance/weight",
      "Apply tempo and control concepts to exercise execution",
      "Develop mind-muscle connection and body awareness during exercise"
    ],
    "related_categories": ["fitness-foundation", "body-mechanics", "injury-prevention"]
  },
  {
    "id": "equipment-gym-basics",
    "name": "Equipment & Gym Basics",
    "description": "Navigate gym equipment with confidence. Learn to identify common fitness equipment, understand safety protocols, and discover alternatives for home workouts when gym access isn't available.",
    "icon_name": "dumbbell",
    "is_active": true,
    "sort_order": 3,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Identify common gym equipment and machines and their primary uses.",
      "Understand equipment safety protocols and etiquette",
      "Learn proper equipment setup and adjustment techniques",
      "Recognize equipment alternatives for home workouts",
      "Understand gym layout and navigation basics",
      "Master equipment cleaning and hygiene practices. Wipe down before and after use. ",
      "Appropriate Gym wear / Sweat wicking / Deodorant / Showers, etc. Use Gym towels if you want to.",
      "Identify when equipment may be unsafe to use",
      "Understand equipment sharing etiquette and time limits",
      "Recognize specialized equipment for different training goals"
    ],
    "related_categories": ["exercise-fundamentals", "mindset-motivation", "fitness-foundation"]
  },
  {
    "id": "nutrition-essentials",
    "name": "Nutrition Essentials",
    "description": "Build healthy eating habits that support your fitness goals. Learn about macronutrients, portion control, meal timing, and how to fuel your body for optimal performance and recovery.",
    "icon_name": "apple",
    "is_active": true,
    "sort_order": 4,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Identify the three main macronutrients and their functions",
      "Understand appropriate portion sizes and serving guidelines",
      "Learn optimal meal timing around workouts",
      "Recognize the importance of hydration for performance",
      "Understand how to read and interpret nutrition labels using multiple common foods",
      "Learn basic principles of balanced meal composition",
      "Identify nutrient-dense food choices",
      "Understanding Calorie energy density",
      "How to not lose muscle mass while on a calorie deficit",
      "You cannot out train a bad diet and that the easiest calorie to burn is the one that you don't eat, understanding the roles of cardio and strength training in this regard",
      "Identifying hidden calories in food and drinks, particularly in nuts, alcoholic beverages, spreads and dressings, sauces and condiments, and specialty coffees, sodas, high calorie smoothies, etc",
      "Understand the role of carbs in preparing for strength training, and protein in muscle recovery",
      "Recognize signs of adequate vs inadequate nutrition",
      "Learn sustainable approaches to healthy eating habits",
      "How to achieve Satiety, avoid overeating, and meet your energy and nutrient needs",
      "How to use the kitchen scale, use the tare function, cup sizes, etc",
      "Master key nutrition terminology and metabolic concepts (TDEE, Calories in and out, Surplus/Deficit, etc)",
      "Understanding the role of fiber and fiber rich foods in satiety and gut health",
      "Carbs is not the enemy, it is the body's preferred source of energy, without it, your body might not be able to function properly",
      "80/20 rule. 80% of the time, you should be eating healthy and 20% of the time you can splurge",
      "Good fats vs bad fats (saturated and trans)",
      "Don't cut out your cravings, reduce them and manage them out if you can. Don't surround yourself with temptations, remove them from your environment if you can, make it hard for you to lay your hands on them."
    ],
    "related_categories": ["fitness-foundation", "recovery-injury-prevention", "health-lifestyle"]
  },
  {
    "id": "exercise-types-goals",
    "name": "Exercise Types & Goal Setting",
    "description": "Discover different types of exercise and learn to set achievable fitness goals. Understand how cardio, strength training, and flexibility work together to create a well-rounded fitness program.",
    "icon_name": "bullseye",
    "is_active": true,
    "sort_order": 5,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Distinguish between cardio, strength, and flexibility training",
      "Understand SMART goal-setting principles for fitness",
      "Learn appropriate workout frequency for beginners",
      "Identify exercises that align with specific fitness goals",
      "Understand progressive overload principles",
      "Learn how to track and measure fitness progress",
      "Recognize realistic timelines for different fitness outcomes",
      "Understand the benefits of combining different exercise types",
      "Learn how to adjust goals based on progress and circumstances",
      "Identify when and how to modify or advance exercise programs",
      "Understand basic hypertrophy-specific training concepts (reps, sets, warmup/working sets, RIR, muscle failure)",
      "Learn body recomposition principles and realistic expectations"
    ],
    "related_categories": ["fitness-foundation", "exercise-fundamentals", "mindset-motivation"]
  },
  {
    "id": "body-mechanics",
    "name": "Body Mechanics & Movement",
    "description": "Understand how your body moves and functions. Learn about posture, core stability, balance, and the fundamental movement patterns that form the foundation of all physical activity.",
    "icon_name": "body",
    "is_active": true,
    "sort_order": 6,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Understand neutral spine position and its importance",
      "Identify the muscles that comprise the core",
      "Distinguish between flexibility and mobility",
      "Recognize proper posture in various positions",
      "Understand fundamental movement patterns (squat, hinge, push, pull)",
      "Learn basic balance and coordination concepts",
      "Identify common postural imbalances and corrections",
      "Understand the relationship between movement quality and injury risk",
      "Learn basic joint mobility and stability principles",
      "Recognize when form should take precedence over intensity",
      "Identify primary muscles involved in core body movements",
      "Develop awareness of muscle activation and recruitment patterns"
    ],
    "related_categories": ["exercise-fundamentals", "recovery-injury-prevention", "fitness-foundation"]
  },
  {
    "id": "recovery-injury-prevention",
    "name": "Recovery & Injury Prevention",
    "description": "Learn the crucial role of rest and recovery in fitness success. Understand how sleep, active recovery, and injury prevention strategies keep you healthy and progressing toward your goals.",
    "icon_name": "shield",
    "is_active": true,
    "sort_order": 7,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Understand the importance of sleep for fitness recovery",
      "Distinguish between active recovery and complete rest",
      "Learn the RICE protocol for minor injuries",
      "Recognize signs of overtraining and when to rest",
      "Understand appropriate recovery time between workouts",
      "Different exercises and their recovery times",
      "Learn basic stretching and mobility techniques",
      "Identify warning signs that may indicate injury risk",
      "Understand the role of nutrition in recovery",
      "Learn when to seek professional help for pain or injury",
      "Recognize the difference between muscle soreness and pain",
      "Distinguish between joint pain and normal muscle fatigue",
      "Develop skills to listen to your body and respond appropriately"
    ],
    "related_categories": ["body-mechanics", "nutrition-essentials", "health-lifestyle"]
  },
  {
    "id": "mindset-motivation",
    "name": "Mindset & Motivation",
    "description": "Develop the mental tools for fitness success. Overcome gym anxiety, build lasting habits, manage expectations, and create the psychological foundation for a lifelong fitness journey.",
    "icon_name": "brain",
    "is_active": true,
    "sort_order": 8,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Learn strategies to overcome gym anxiety and build confidence",
      "Understand the science of habit formation and behavior change",
      "Recognize the difference between motivation and discipline",
      "Learn how to handle plateaus and setbacks effectively",
      "Understand the importance of social support in fitness success",
      "Develop realistic expectations for fitness progress",
      "Learn positive self-talk and mindset techniques",
      "Understand how to maintain consistency during challenging periods",
      "Recognize and address common psychological barriers to exercise",
      "Learn strategies for long-term adherence to fitness routines",
      "Working exercise and wellness into daily routines, Fitness is not just in the gym or an outdoor marathon. ",
      "Don't find time, incorporate: watch your favorite shows, do social media, or have your meetings while on the treadmill/cycling etc. Have that long phone call while on a walk. Do your grocery shopping physically and carry your bags. Walk or cycle with your kids to school. Do some pushups or squats while watching your Kids at the playgound/park."
    ],
    "related_categories": ["fitness-foundation", "exercise-types-goals", "health-lifestyle"]
  },
  {
    "id": "health-lifestyle",
    "name": "Health & Lifestyle Integration",
    "description": "Connect fitness to your daily life and overall health. Learn how exercise impacts common health conditions, discover ways to stay active throughout the day, and build sustainable wellness habits.",
    "icon_name": "heart",
    "is_active": true,
    "sort_order": 9,
    "created_at": "2025-08-27T00:00:00Z",
    "updated_at": "2025-08-27T00:00:00Z",
    "learning_objectives": [
      "Understand how exercise impacts stress management and mental health",
      "Learn ways to incorporate movement into sedentary lifestyles",
      "Recognize the relationship between exercise and sleep quality",
      "Understand minimum exercise recommendations for health benefits",
      "What is sarcopenia, and how does it affect your health and fitness, and how to mitigate it?",
      "Learn how fitness can support management of common health conditions e.g. diabetes, hypertension, high cholesterol, joint pain, etc",
      "Understand the importance of consistency over intensity for beginners",
      "Recognize how lifestyle factors impact fitness success",
      "Learn age-appropriate exercise considerations",
      "Understand the connection between physical activity and disease prevention",
      "Learn strategies for maintaining active lifestyles long-term",
      "Understand how exercise affects specific health markers (cholesterol, blood pressure, blood sugar)",
      "Learn the importance of establishing health baselines and regular monitoring. Using Apps and Wearablese.g. MyFitnessPal, Apple Health, Google Fit, Apple watch etc",
      "Understand when to consult healthcare professionals before starting exercise programs",
      "Learn to track and analyze progress using various measurement methods and tools. Check your Apple health trends, use the ECG app on Apple Watch, etc"
    ],
    "related_categories": ["nutrition-essentials", "recovery-injury-prevention", "mindset-motivation"]
  }
]